{"53235807": [{"review": "Cutest little cabin in the woods. I would stay here again anytime without hesitation! I am VERY picky about cleanliness and this place was spotless. Lots of adorable little cabin-y touches and it’s clear they take pride in their place. The bed was king sized and very comfortable. Corey was super responsive and gave lots of great recommendations. We did a gorgeous hike to mirror lake and enjoyed the hot tub and gas fireplace in the cozy mornings. We only had two nights here but enjoyed our stay SO much!", "rating": 5}, {"review": "This place was great and can’t wait to be back. Corey is quick to reply and absolutely loved the recommendations!", "rating": 5}, {"review": "Love this cabin it was so beautiful and peaceful it felt like home. Such a beautiful view around the cabin. Corey recommended a lot of hikes and activities to do definitely will come back", "rating": 5}, {"review": "Cute, clean space with fenced backyard. Great location near hiking trails and restaurants.", "rating": 5}, {"review": "The photos of this place do not do it justice! This cabin is SO SO cute. Every room is so stylish, so nice, and so cozy feeling. It has the old school cabin charm we were looking for, but with modern finishes and appliances. The backyard is amazing, we spent so much time hanging out in the sun playing cards and dipping in and out of the hot tub. It's totally private and I loved napping in the hammock. There are so many gorgeous hikes nearby and my boyfriend and I actually ended up getting engaged on one of the trails. It was such a treat to return to our romantic little cabin afterward. We had such a memorable and special weekend and this cabin played a huge role in that. The host was super friendly, responsive, and clearly invested in us having a good time. Can't wait to come back!!!", "rating": 5}, {"review": "This is an adorable little cabin in the woods. The owners thought of everything. Great getaway for a quick trip to Mt Hood. I highly recommend this wonderful place.", "rating": 5}, {"review": "Very well designed and detailed home.  Not your typical rental.  Everything from the furniture, to the lighting, to the linens, to the kitchen were well thought out and designed.  Very cool.<br/>Kitchen had everything we needed and the hot tub worked perfectly.  Master with bed/bath was perfect, and the loft space with the additional bed is very cool.  And very nice having the additional 1/2 bath with washer/dryer.<br/>Was a little bummed that there were no exterior chairs for enjoying my coffee in the mornings, and no grill for cooking out at night.  Definitely need both of those for a mountain house.<br/>And just be aware, it backs up right to Lolo Pass Rd.  So there is noticeable car noise.<br/>Otherwise, we loved it and would definitely stay there again.", "rating": 4}, {"review": "We had a wonderful stay at Corey’s place during our visit to the area. It was conveniently located, making it easy to explore and enjoy the abundance of activities nearby. Some of our favorite adventures included hiking the Timberline Trail from both Mt. Hood Meadows and Timberline Lodge, where we also explored Zigzag Canyon and sections of the Pacific Crest Trail. We also made stops at Trillium Lake and Little Crater Lake—both absolutely worth the visit. With all the hiking we had done, it was so nice to be able to come back, enjoy the hot tub and relax.", "rating": 5}, {"review": "Great little cabin and amazing back yard.", "rating": 5}, {"review": "Magical little cabin with a hot tub. Super cozy inside and out. Close to all the fun that Mount Hood has to offer!", "rating": 5}, {"review": "This was the most lovely and peaceful stay, which was exactly what I needed! I booked this cabin as a place to recharge, and I spent time soaking in the hot tub, reading in the hammock, and watching a fire. My pup and I felt right at home, and the house was very well thought out and so welcoming. 10/10, will definitely stay again!!", "rating": 5}, {"review": "This was our second time staying here. We had a great time! The fenced backyard is secure for your pups, the hot tub is relaxing, and the inside of the cabin is cozy as can be. The bed is extremely comfortable!", "rating": 5}, {"review": "it was such a lovely place! would definitely stay again", "rating": 5}, {"review": "I had a lovely quiet stay with my dog. Everything was clean and comfortable. the backyard was lovely to play with the dog and we had a good time hanging out and playing games. Definitely would recommend!", "rating": 5}, {"review": "Everything was just as described: clean, comfortable, and cozy. We had a great time enjoying the hot tub, relaxing by the fire pit, and soaking in the peaceful vibe. A perfect little getaway. Would definitely stay again!", "rating": 5}, {"review": "had another great stay at the cabin. perfect spot to unwind.", "rating": 5}, {"review": "Another great stay at the Hütte! The local recommendations were much appreciated. We enjoyed hiking by day, and then sitting by the fire and soaking in the hot tub by night!", "rating": 5}, {"review": "Was a very relaxing stay!!", "rating": 5}, {"review": "We loved our stay and wish we had more time! I hope to come back with my daughter and our dog!", "rating": 5}, {"review": "I absolutely loved staying at this Airbnb. The attention to detail is impeccable. The amenities are up to date and the experience has been nothing short of blissfull. I would highly recommend this airbnb especially for how special it makes you feel. I visited with my boyfriend for a day in the wilderness for my birthday and I felt absolutely taken care of. We loved everything and cannot wait to visit once we are back in Oregon again. A MUST VISIT PLACE ❤️❤️", "rating": 5}, {"review": "This truly was one of the best air bnb experiences I’ve had plenty of towels which is so key when you’re enjoying the hot tub and hikes in the day. Great location and the local restaurants were surprisingly good. Don’t miss Ferny’s coffee shop great breakfast options and coffee. Corey was very responsive and helpful. Gave advice on where to buy park passes, and allowed us to access the place long after checkout when we realized we left laundry there. Overall great stay!", "rating": 5}, {"review": "Quiet and peaceful  place to stay. The house was clean and felt at home!!", "rating": 5}, {"review": "Great cabin in the woods for a wonderful getaway. Highly recommend!", "rating": 5}, {"review": "This was our third time staying here and it was beautiful and peaceful as always :) It's a very quiet and private location, surrounded by trees, and the cabin is super cute with all the amenities you might need.", "rating": 5}, {"review": "Just a magical little forest nook- it’s exactly the vibe you want when booking this kind of place. You instantly feel at home in this cozy little forest oasis. Just book it!. Host super responsive and helpful. Thanks Corey!", "rating": 5}, {"review": "This is one of our favorite places we’ve ever stayed. Wish we had been able to book longer. We needed a weekend out of the city and in nature, but somewhat still close as we have a new little one. This was the most perfect spot. The hot tub was amazing, the house has every detail thought out and well-planned. Hats off to Corey and team, we will be back if they’ll have us for sure!", "rating": 5}, {"review": "Corey was an excellent host, very communicative and helpful, with clear instructions about the cabin! <br/>The cabin was lovely, well appointed, and peaceful. The hot tub was very clean, private, and I appreciated being able to adjust the temperature as desired.", "rating": 5}, {"review": "The cabin was amazing and exactly what we needed to escape for a couple days with our dogs. Would recommend the cabin to anyone! We loved it!", "rating": 5}, {"review": "We had a wonderful time! Such a cozy and peaceful place, surrounded by nature’s beauty. We appreciated the local recommendations, and really enjoyed evenings around the fire and in the hot tub. Just what we needed, we hope to come back soon!", "rating": 5}, {"review": "We enjoyed our short stay at this adorable cabin. We appreciated the hot tub and the fenced in yard for my pup. Thank you for hosting us!", "rating": 5}, {"review": "This cabin is absolutely perfect! The whole place is so comfortable and it has everything you need to relax. The location is a great jumping off point for exploring the Mt Hood area, I was at Timberline lodge within 24 minutes of leaving the driveway. The shower has great water pressure, the bed in the master bedroom is insanely comfortable, and of course the hot tub was awesome after a long day of hiking. Corey was very friendly and reached out in advance about check in instructions and he even gave some local recommendations. Can’t recommend it enough, if you’re staying in the Mt Hood area, don’t bother looking anywhere else, this is the spot!", "rating": 5}, {"review": "We had a great time enjoying the scenery of Mt Hood as well as the cabin. It was very cozy and clean. Had everything we needed to cook which was nice.", "rating": 5}, {"review": "This cabin is adorable and cozy ! Many extra nice  touches like snacks and maps. The bed is very comfortable , hot tub clean and new. Perfect location for exploring mt hood.", "rating": 5}, {"review": "Perfect for a peaceful getaway. You can tell they put a lot of time and love into their space. Would stay here again!", "rating": 5}, {"review": "Cute space, nice outdoor space. Was very clean.", "rating": 5}, {"review": "Highly Recommend", "rating": 5}, {"review": "My partner and I came here with friends to celebrate our engagement and Corey was so kind and helpful! My fiancée coordinated with him so that his sister was able to set up a little scavenger hunt to find my ring in the cabin before we arrived. Every room was very clean and tidy, the dishes were pristine and everything was convenient for us to use! The hot tub was very clean, and the backyard area secure for our dog. We will absolutely be coming back here (:", "rating": 5}, {"review": "My husband and I immediately felt at home when we entered this beautiful cabin. Very peaceful and beautiful place to be .... Corey was always responsive and gave amazing recommendations , I definitely recommend this place !", "rating": 5}, {"review": "Corey's place was great.  Super pretty location and had all the amenities we were looking for. We had a nice peaceful time away from the city with our 2 month old. Would highly recommend!", "rating": 5}, {"review": "We loved our stay and would definitely come back! The hot tub was so relaxing and it was nice the whole yard is fenced so it felt private. Such a cute, cozy cabin!", "rating": 5}, {"review": "We couldn’t have enjoyed our stay anymore than we did! The cabin was beautiful, relaxing and felt like home away from home for our two nights. We will be back!", "rating": 5}, {"review": "Very cute and comfortable house. Fenced yard for the dog was a plus. Host was super friendly and available through messaging. Had a slight issue with the hot tub the first night but I reached out and he got back to us super quickly and we were able to fix it easily. Made for a lovely trip to the mountain and we would definitely stay again.", "rating": 5}, {"review": "Great getaway location. Enjoyed the hot tub, the Games, and the gas fire.  Beds were comfortable. Kitchen was well-stocked. Fenced backyard was perfect for the pup! Thank you for your hospitality.", "rating": 5}, {"review": "This was such a great stay! My husband and I along with our 2 pups stayed here for 2 nights. It was absolutely relaxing and beautiful. We enjoyed the hot tub, had a comfortable bed, equipped kitchen, and a lot of helpful/useful recommendations. Absolutely recommend this place!", "rating": 5}, {"review": "We absolutely loved this lil cabin. Wonderful fenced yard and awesome hot tub. It was a perfect birthday weekend here- and we would definitely stay here again.", "rating": 5}, {"review": "Corey was a wonderful host. Super proactive and responsive. The cabin was wonderful- bigger than I expected. Comfy linens, well decorated, well stocked, modern yet vintage. Great location for outdoor activities! Our boys loved the canvas tented loft for sleeping!  The backyard was beautifully decorated with stringed lights, a fire pit area, hammock, hot tub and tons of firewood.   Will return!", "rating": 5}, {"review": "This cabin is a DREAM. The best outdoor mountain space for relaxing and enjoying the fresh air. The hot tub after a night on the mountain was perfect. The house is clean and cozy and stocked with all the essentials. The beds were so cozy and the tent is a fun experience! Very pet friendly. We will absolutely be back! Corey was so flexible and welcoming.", "rating": 5}, {"review": "This was a beautiful little cabin. very cozy, I wish I stayed longer.", "rating": 5}, {"review": "Corey provides a cozy cabin experience. The fireplace worked well, the jacuzzi was spacious and relaxing.", "rating": 5}, {"review": "A great spacious cabin, with an amazing backyard. Had an amazing time, Thankyou for having us!", "rating": 5}, {"review": "Corey’s cabin is beautiful and had everything I needed to have a great experience. If I take my dog on another dogcation in the area, I’ll be returning to Corey’s cabin!", "rating": 5}, {"review": "Amazing cabin in the woods with a hot tub! This place was much bigger than the pictures made it seem. Cozy couch in front of a fireplace, what more could you need.", "rating": 5}, {"review": "Corey’s place was amazing!! I think it was priced reasonably for how nice/accommodating the space was (plus a hot tub), as well as the location. He was very responsive to my messages, as well as helpful! I’ll definitely be back.", "rating": 5}, {"review": "Nicely maintained cabin in the woods with great yard and hot tub. Good communication with host", "rating": 5}, {"review": "Very nice home, the hot tub was amazing. Very cozy place.", "rating": 5}, {"review": "We loved it. The whole cabin was cozy, warm, clean and we didn’t want to leave but we had to. Haha :) 10/10 would definitely stay there again.", "rating": 5}, {"review": "I can honestly say that this was one of the nicest AirBnB's we've ever stayed at! It was my husband, my daughter and I celebrating a family \"win\" by having our first ever, family snowboarding trip. Staying at the warm, cozy cabin with a hot tub after a day in the snow was... heaven!!! They left the gas stove on so that it was warm when we first walked in; such a nice touch. Great response time from the host's as well. There is a reason this place is usually booked. It's well worth it! We hope to be back! :)", "rating": 5}, {"review": "Very cute and clean place! Couldn’t be happier with our stay", "rating": 5}, {"review": "We loved staying at this cabin. It felt super cozy and Corey was an extremely responsive and friendly host. There was a washer and dryer too that we didn’t notice it in the listing. I slept like a baby and had a nice restful weekend. I often feel like Airbnb reviews are over inflated, but I can honestly say we felt that Corey’s place was even better than we expected. <br/>The only very minor drawback which cannot be controlled by the host is that there is frequent noise from cars driving by on Lolo Pass Road that you can hear in both the backyard and living room. It took from the secluded feeling a bit, but you cannot hear it from the bedroom which was dead quiet. <br/>Would visit and stay here again!", "rating": 5}, {"review": "Corey’s place was a dream! Very clean, cozy, and well-stocked. The space was nicely decorated and the outdoor space was great to hot tub in. Overall, he was a great communicator and would definitely stay there again!", "rating": 5}, {"review": "Great customer service.  Very kind hosts.", "rating": 5}, {"review": "Easy to find and great to stay. Pretty straightforward; amenities were clean and easy to use.", "rating": 5}, {"review": "Loved this stay! Felt very cozy and comfortable. Our doggie loved exploring the fully fenced yard and we loved the NPS vibe inside!", "rating": 5}, {"review": "A tranquil oasis right off the mountain, close to all the good spots. Super clean and cozy, would highly recommend! Cherish the cabin!", "rating": 5}, {"review": "The hütte was very cute & cozy for our ski weekend. Corey was responsive and provided great food recommendations! The hot tub was very clean and the yard was secure for our dog. I love the ski gate on the fence 🎿", "rating": 5}, {"review": "me and my kids loved it, we felt right at home they ha died questions or concerns quickly and promptly. sure easy to contact which made it amazing felt right and home and comfortable!", "rating": 4}, {"review": "If you want to get away and relax in the mountains, look no further, Corey’s hütte is the perfect combination of peaceful, beautifully decorated, and tidy! The hot tub was clean and the space gave such cozy cabin feels! Corey was also a very kind and friendly host, allowing us to check in 30 minutes early and 30 minutes late! We will be back 😊", "rating": 5}, {"review": "Loved staying here! Hosts were helpful and the place is wonderful!", "rating": 5}, {"review": "Beautiful cabin, great location, and wonderful hosts!", "rating": 5}, {"review": "We loved this cabin! Super cozy, great location. Hot tub and board games were a hit!", "rating": 5}, {"review": "Came back! This was my second stay at Corey’s hutte. This time I had a belated holiday with my adult children and we enjoyed this place so much! The setting with the hot tub is beautiful and very private, a must after a day of Nordic skiing at Tea Cup. The fireplace, so cozy and lots of fun board games to play as we enjoyed it. The kitchen is a great space to cook many meals. Comfy beds, beautifully decorated spaces, sweet touches. A must stay!", "rating": 5}, {"review": "Great space. By far the nicest mountain Airbnb I’ve ever stayed in. Extra like the lighting really made it a great experience five stars!!!!", "rating": 5}, {"review": "Had a great stay! Very cute cabin and well stocked kitchen with all appliances we needed! Hot tub was wonderful after a full day on the mountain.", "rating": 5}, {"review": "Excellent cabin in an excellent area. Stayed here for a few days of planned skiing up at Mt. Hood. The cabin was exactly what we needed. Great kitchen amenities, comfortable living room, well-maintained hot tub, clean linens, and very private. Will definitely try and come back!", "rating": 5}, {"review": "We really enjoyed our short stay. Saving this listing— we’d stay again for sure! Everything was wonderful. Warm, welcoming, perfectly appointed and well stocked with everything you could need. We loved the peaceful atmosphere, nestled in the tall trees. <br/>Thank you!", "rating": 5}, {"review": "Corey was a fantastic host - responsive and helpful! They’ve put a lot of attention to detail and thoughtful touches into the house. Beds were super comfortable! We very much enjoyed our stay and hope to visit again :)", "rating": 5}, {"review": "My husband and I stayed here for a ski trip to meadows and had the best time! About a 16 minute drive to government camp and 35 to the mountain we were able to get in 8 hours of skiing on our trip! And after a long day of skiing Corey’s cabin felt so cozy and private. The best part was the hot tub after a long active day. We would love to come back in the summer even! This cabin was perfect we couldn’t recommend it enough.", "rating": 5}, {"review": "What a cozy cabin with a thoughtful design! We’ll come back again.", "rating": 5}, {"review": "Love this place! Corey is an exceptional host. This was our 3rd stay and we will be back.", "rating": 5}, {"review": "The cabin was very nice, Corey was very responsive and accommodating, however we were there at a bad time so it was very busy. there was some unplanned construction but the host was very helpful, accommodating and did his best to make us feel welcome.", "rating": 5}, {"review": "Great home great host.", "rating": 5}, {"review": "Wonderful Cozy place. Corey was super communicative and flexible! Definitely plan to spend more time here in the future!", "rating": 5}, {"review": "Corey was super responsive and shared thorough instructions before arrival with a ton of local recommendations. We travel often with our two dogs and so appreciate that this was truly a dog friendly rental- no extra fees or deposits. Even though it was cold we enjoyed the back yard and fire pit. Also appreciate Corey's chill check out procedures- no long list of things to be done by the renter. There was some unexpected waterline work in the neighborhood that made our last morning a little less than ideal but Corey was proactive with his communications regarding the situation and understanding of our concerns. The upstairs tent provides a unique touch and this cabin provided the restful reboot we needed.", "rating": 5}, {"review": "The cabin was so cozy and adorable. The kitchen had everything we needed. Check in was super easy. Communication with Corey was great. We definitely plan to stay again in the future.", "rating": 5}, {"review": "We had a wonderful time and hope to be back again soon.", "rating": 5}, {"review": "What a cozy wonderful cabin getaway! I will definitely book this spot again.", "rating": 5}, {"review": "A perfect place to relax at the mountain. This is one of those stays that you can tell the hosts put a little extra effort into making guests comfortable.", "rating": 5}, {"review": "Corey was communicative, the details and instructions on the place were clear. The place itself was perfect and we just had a 10/10 experience.", "rating": 5}, {"review": "Great little cabin to have some r&r. Very comfortable and homey.", "rating": 5}, {"review": "We absolutely loved staying here. Great locations for hikes & conveniently located close to restaurants/grocery stores. Felt very peaceful, great vibes. Corey was very helpful & provided excellent recommendations. <br/>Would love to stay here again. 10/10 Recommend. 🌲🏔️", "rating": 5}, {"review": "This was the best little fall mountain getaway! We will be back!", "rating": 5}, {"review": "Corey was super friendly and his cabin made us feel right at home , he had blankets, heater with a fireplace which it was ideal since we are from Florida! I loved staying in the cabin and didn’t want to leave since we felt so at home , if you are looking for a place to reconnect with nature and cool hikes while feeling at home look no further you found the perfect place ! Thank you Corey for being super attentive and nice!", "rating": 5}, {"review": "Corey’s place is so cozy!! We absolutely loved our stay. From the interior decor, to the hot tub, the backyard, to the games that were available, this place was magical!", "rating": 5}, {"review": "Peaceful, private, beautiful little cabin with lots of trees, lots of hikes and beautiful places around. It was everything we were looking for, and Corey's attention to little details all throughout the house made our trip feel like home, including all the pretty cozy lights and even small little paw blankets for my doggie. He's very helpful, lots of recommendations provided around the place, clean and cozy cabin, the fire pit and the hot tub were great; poor cellphone connection but in our book that was a plus, and they do have great wifi. Overall a great experience, and we can't wait to be back sometime!", "rating": 5}, {"review": "My girlfriend and I had a great time! Place was exactly as we’d hoped!", "rating": 5}, {"review": "This is such a lovely cabin getaway! Nice and private with a beautiful fenced in backyard area. Inside was nice and cozy. Corey was a great host and even noticed when the internet stopped working and messaged me on how to fix it. So helpful! Would stay here again", "rating": 5}, {"review": "I really enjoyed staying here! I showed up on accident 30 minutes early and the hosts were okay with letting me in early. I also forgot some thing and had to check out five minutes late. The hosts were totally understanding! The place was very clean and the hot tub was in excellent condition. The restaurant recommendations were great. We ate dinner at Koya and it was delicious. I would definitely recommend staying here!", "rating": 5}, {"review": "Perfect cozy cabin for our stay!", "rating": 5}, {"review": "This was such a serene place to stay! The Host offered some great recommendations for local trails, restaurants, and more! Will definitely be back!", "rating": 5}, {"review": "This cabin is fabulous. Highly recommend.<br/>The beds are COMFY (of upmost importance to me!). The aesthetic is great, the sofa is comfy, the hot tub is hot, the kitchen is warm and cozy. It’s just a great spot, very homey. We got so many hikes in; was great to come home and soak afterwards. We had everything we needed. The loft stairs are tricky but fine for me since I’m a shortie. Slept great here.", "rating": 5}, {"review": "Great place! <br/>Loved all the small details on this lovely property!", "rating": 5}, {"review": "Comfortable king sized bed, loved the retro board games,  and the hot tub in the beautiful PNW woods was perfect. Very dog friendly! Super cozy inside with the fireplace. Was easy for us to bring groceries and cook most of our meals at the cabin. Corey sent us local places to hike, shop, and eat and that was very helpful. We would love to come back and stay again!", "rating": 5}, {"review": "Stayed here for a little mini moon and absolutely loved it. Feels even cuter than the pictures, very private backyard, where we spent most of the time hanging out and going in the jacuzzi. Cozy living room with games and very comfortable bed. Very close to the town so it was really easy to get to and from places, but felt peaceful and serene at the cabin. We had some Internet issues while we were there, which seems to be a fluke, but were able to log on a little bit, and was very high speed while it was working. Corey was great - extremely helpful and responsive and gave amazing recommendations for the area. Highly recommend!", "rating": 5}, {"review": "Corey’s house was the perfect place for the few days we stayed in Rhododendron, it was a quick trip to Mt. Hood and close enough to other towns like Sandy. It’s an hour from Portland and 35 minutes to most waterfalls on the Columbia Gorge Hwy. <br/>The home itself was well maintained and cozy. We really enjoyed the hot tub and the bed was also comfortable. We’d love to come back again and bring our pups!", "rating": 5}, {"review": "Best Airbnb I’ve ever stayed at! Will definitely stay again! Highly highly recommend!", "rating": 5}, {"review": "This was our second stay and it feels so peaceful. The energy of the cabin is very grounding. It is a great location and pretty easy to find. The yard is fenced it and it gives a sense of privacy. We felt very relaxed and present. Close drive to many cool restaurants and local attractions.", "rating": 5}, {"review": "Great place to stay with lots of great amenities (we loved the hot tub). Very friendly and responsive host with great local recommendations.", "rating": 5}, {"review": "Corey was very responsive. The place is nicely done, the yard is very peaceful and welcoming, and hot tub was fun. Location is great with many wonderful hikes nearby.  There are enough restaurants and a small grocery store by nearby so you don't  need to travel far if staying for a few days.  The stairs upstairs to the loft are probably not for everyone, but the tent/yurt feel is clever for the space.  I would stay again!", "rating": 5}, {"review": "This cabin is becoming a favorite retreat for us, so we'll done and peaceful!", "rating": 5}, {"review": "This is one of the nicest Airbnbs that we have ever stayed at. It was thoughtfully designed and had everything you may need including a lunchbox with a couple of treats, lots of hooks to hang towels, and a basket of clean blankets in case you get cool. The location is convenient to some great hiking trails and all of the hiking and restaurant recos were spot on. We would definitely stay here again.", "rating": 5}, {"review": "We had such a wonderful time during our stay! It was very private with the fully fenced yard that our pup loved! The inside is super cozy making for a romantic getaway. Hot tub was perfect for sunset views and star gazing. Definitely would come back!", "rating": 5}, {"review": "We loved this stay!! This place was even better than the pictures. A perfect spot to retreat to aesthetically, and very clean.", "rating": 5}, {"review": "We loved this little cabin in the woods! It was perfectly cozy and close to lots of great hikes. Loved the hammock and hot tub in the back yard! Corey was great and super responsive. We would definitely stay again!", "rating": 5}, {"review": "Solid cabin in the woods. 10/10", "rating": 5}, {"review": "It was an awesome stay clean and nice and I was blown away when I asked him if he could get me a bottle of wine ready there for my wife’s B-day get away. He was like what you want I’ll have it waiting for you. It was a shot in the dark so I didn’t really expect anything, but he was all about getting it ready for me. It was a great stay and we’ll be back. Plus pet friendly was a big part too bc my wife doesn’t like to leave are puppy alone. Thanks Corey", "rating": 5}, {"review": "We had a wonderful stay! Beautiful cabin, very clean and very well stocked. Close to restaurants but still felt secluded, quiet, and private. The beds were very comfortable, and the cabin was spacious. Overall a fantastic stay and relaxing weekend getaway.", "rating": 5}, {"review": "Corey's place looked exactly like the photos-- a super cute, updated cabin that still has a traditional log cabin cozy feel! Very nice decor, well-stocked kitchen and extremely clean. His instructions were clear and organized, so it was smooth and easy to check in and out. You're just down the street from a couple great breakfast/dinner spots in Zigzag, and we appreciated the recommendations he sent us. He's right, by the way, the brisket from Skyway Bar & Grill is delicious!! Very dog friendly, too-- our pup loved exploring the fenced backyard. We would come back in a heartbeat!", "rating": 5}, {"review": "Cute little cabin surrounded by trees but with just enough sun hitting the secluded backyard. Great weekend spot for couples", "rating": 5}, {"review": "This is a great cabin, with a surprising amount of amenities nearby for such a sparsely populated area. There is a great grocery store nearby, as well as several good restaurants. The host's recommendations were very useful in identfying nearby resources. He also provided a lot of helpful tips about the area. The cabin itself is very well-appointed with everything you need for any length of stay.v Overall, I had a great experience with this accommodation.", "rating": 5}, {"review": "We had a great time staying at the cabin! The hot tub was great to use after a hike around Trillium Lake. Best of all, it's dog friendly with an enclosed yard.", "rating": 5}, {"review": "We completed the Timberline Trail on Mt Hood and Corey’s place was the perfect place to land our exhausted bodies. The house is adorable and stocked with everything you need including a great assortment of board games! The hot tub is amazing and the beds are incredibly comfortable!! This is truly a great place for any season and I highly recommend staying here!! Corey was very helpful and responsive to all of my questions and provided fantastic information about our stay!!!", "rating": 5}, {"review": "Delightful remodel, charming, clean. More in the midst of a neighborhood than isolated in the woods. Hosts were totally responsive.", "rating": 4}, {"review": "We had a great time!  The place is conveniently located about an hour from PDX, but far enough out in the country to be really quiet.  It was tidy and neat, and Corey was super helpful with questions and suggestions on things to do.  Thanks again for a great stay!", "rating": 5}, {"review": "A very quiet, charming, and private place.  the Airbnb looks even better in person and was perfect for our getaway. the host was very responsive and was helpful and gave a multitude of places to visit and restaurants to eat at. The hot tub was very clean and easy to use. The kitchen was equipped with everything you'd need. The bathrooms were very clean and the king sized bed in the master bedroom was extremely comfortable. We felt right at home and highly recommend this place to anyone visiting the Mt. Hood area.", "rating": 5}, {"review": "We loved our stay at the cabin! Such a peaceful setting to relax and enjoy the outdoors, and of course, the hot tub. Everything was clean and as pictured with lots of little touches to make you feel at home. We would love to visit again!", "rating": 5}, {"review": "Cozy little cabin that was perfect for our family. The host was really accommodating to our last minute booking and was all around a pleasure to work with. <br/>Would highly recommend to anyone wanting a nice place to stay near mount hood.", "rating": 5}, {"review": "Really cute cabin with nice updates. Host provided extra treats and accommodations for my dogs. Great communication and answered all of my questions quickly.", "rating": 5}, {"review": "This place has a great host, a great hottub and great decor. We'd come back next weekend if we could. :)", "rating": 5}, {"review": "Our stay was fantastic.  Just as advertised.  Very clean.  Hot tub was great and clean.  Really nice place.  We’ll be back for sure.  Corey was a great host.  Stayed in touch with me throughout making sure we had everything we needed. Much appreciated.", "rating": 5}, {"review": "First time renting a cabin & this was the perfect weekend getaway . It was so peaceful & pretty. The hot tub was a nice touch . Lots of fun things to do in the area , good spots to eat. Host was very helpful & nice & gives lots of recommendations, would definitely stay here again. 😊", "rating": 5}, {"review": "We had a great time at this cute little cabin. It was rainy so we were not able to use the outside fire pit, but the hot tub was awesome. Having the privacy fence was nice too with how close the neighbors were. Awesome spot.", "rating": 5}, {"review": "I came with my girlfriend to relax after a tough year of school for her and work for me. It was perfect-easy to book, find, and check in, quiet, clean, comfortable, the hot tub was relaxing and clean, and all for an affordable price. Thanks Corey!", "rating": 5}, {"review": "I love everything about this place! If I wasn’t on a roadtrip for my pups 16th birthday / last chapter of her life we would have loved to stay longer. One of the best hosts I have encountered and the place is even cuter than the pictures if you can believe it. Would come back! 10/10 recommend", "rating": 5}, {"review": "Booked this as a birthday gift for my sister in law. Corey was super proactive in reaching out and made it easy for me to loop my brother in on the reservation. We were able to surprise her and they had a wonderful getaway. By all reports it was a great stay and a fab place to escape to for the weekend!", "rating": 5}, {"review": "Really lovely weekend getaway, very relaxing and cozy!", "rating": 5}, {"review": "We loved this cozy, clean, updated, & homey cabin! It was perfect for the 4 of us on a girls trip. Corey was very communicative & gave us great local recommendations, we loved Skyway BBQ. The hot tub and fire pit was great, I’d bring fire starter if you need, though! Would love to come back again one day!", "rating": 5}, {"review": "The cabin was so beautiful and it was great having a full fenced yard for our dogs. Corey was incredibly communicative and helpful.", "rating": 5}, {"review": "Very cute, cozy and clean cottage in a quiet neighborhood. Only trouble we ran into was the driveway-very steep and narrow. It was difficult for us to pull in and out in a truck without turning around in other driveways, but I suspect it would be fine in a smaller vehicle. Loved the backyard space for our pups and the living room was so cozy! Only thing this cabin needed was more hooks for hanging coats/towels/dog leashes etc. It was a rainy weekend and we ended up with wet jackets and towels drying over chairs. Overall I would stay again if I was in the area.", "rating": 5}, {"review": "Corey’s cabin was wonderful and had all the essentials. The interior was cute and comfortable, and we had a great time hanging out in the backyard. I love that the yard is fully fenced, so my dog could run around. <br/>I hope to be back!", "rating": 5}, {"review": "Corey was a wonderful host! He was so helpful and friendly. It was our first time in Oregon, he answered all my questions and gave us great ideas on activities to do and where to go. <br/>The Hutt was so cozy and had everything we needed for our stay. We hope to return some day soon!", "rating": 5}, {"review": "Great and cozy cabin.", "rating": 5}, {"review": "We loved the amenities of the hot tub, has fireplace also a feeling of a voucher cabin in the woods with modern amenities.  It was a place of peaceful retreat.", "rating": 5}, {"review": "the place was beautiful and clean.  felt private and secluded. Wife and I enjoyed of 8th wedding anniversary here and had a great time.", "rating": 5}, {"review": "We loved staying at this sweet cabin. It so so peaceful, beautiful, and clean. The hosts thought of everything and all the touches inside the cabin are so nice. The backyard is the perfect oasis to unwind in the hot tub. Big comfy beds. And the upstairs loft area is so cozy and such a genius use of the space. My family and I hope to visit again in the future.", "rating": 5}, {"review": "this place was SO COOL.  amazingly cozy, and felt right at home! the hosts are amazing as well! if you're looking for a homebase for exploring mt. hood,  look no further!", "rating": 5}, {"review": "Amazing mountain area cabin, you can tell Corey took a lot of care setting the place up. We had an amazing stay. I definitely recommend this place if you are visiting Mt. hood area.", "rating": 5}, {"review": "A beautiful and private place, with a responsive and thoughtful host :)", "rating": 5}, {"review": "Corey’s home was so peaceful and inviting, we didn’t want to leave. The whole home was immaculate and we adored all the details and fell in love with the backyard. We had plans to do so many things in the area but ended up just resting and enjoying the ambience of the cabin. A true gem!! Would love to come back and stay longer.", "rating": 5}, {"review": "Great place next to Mt. Hood with great hosts.", "rating": 5}, {"review": "amazing cabin!", "rating": 5}, {"review": "We loved staying at this Cabin! Was very nice and clean. We also loved the hot tub! Corey was very responsive and had some great suggestions!", "rating": 5}, {"review": "We had a wonderful stay at Corey's cabin. The cabin was perfectly cozy for a long weekend indoors (the rainy weather chose not to cooperate with us). We especially enjoyed the hot tub and gas fireplace. Perfectly located off the beaten path, but not so far that it's a hassle if you need to \"run into town\" or want to go grab a bite or drink out. Corey was very responsive and friendly, and communication was excellent from booking through the end of our stay. We would definitely book again.", "rating": 5}, {"review": "Corey's cabin is such a chill spot! We really enjoyed our time there. The yard was so quiet and peaceful. We loved roasting smores over the fire and looking at the stars. The hot tub was pure bliss! We felt right at home and Corey is a friendly, responsive host. Hoping to come back for our next Mt. Hood trip 🏔🌲", "rating": 5}, {"review": "Corey was an incredible host! The cabin exceeded our expectations. I definitely recommend it and will be coming back.", "rating": 5}, {"review": "Sweet, magical, relaxing space!  We loved the upstairs loft bunk/tent.  The outside space is gorgeous!  Love the big trees and the little trilliums!  The vibe/aesthetic inside was lovely and well-considered. <br/>If you are allergic to dogs you might have a little trouble - definitely a dog space", "rating": 5}, {"review": "Super thoughtfully arranged, great ammenities, sweet location. We had a great time! Our pup loved the backyard - he's not much of an escape artist, but I wouldn't have worried if he was. Close to a lot of great restaurants and hiking trails.", "rating": 5}, {"review": "the home was beautiful, secluded and just what we needed for a relaxing weekend.", "rating": 5}, {"review": "Corey's place was beautiful; it felt private and secluded, yet was close to shopping, restaurants, and all of the hiking you could wish for. the showers have good pressure and the fire makes the entire cabin cozy and comfortable. would recommend to anyone getting away for a weekend", "rating": 5}, {"review": "Lovely. Kid and dog friendly. Clean, close to the major roads and super graceful host. This was our second visit, will return again and again. Just adore this cabin. The kids loved the loft but big enough for adults. The little touches throughout are appreciated and love having laundry on site. Hot tub is well maintained. Beds are very comfortable. All the kitchen utensils you need! Grocery store is close by and the local restaurants are good.", "rating": 5}, {"review": "This place was perfect! We will definitely return again!", "rating": 5}, {"review": "This is our second stay at Corey's cabin, and we loved it!  We brought out dog with us this time and it was perfect for all of us!", "rating": 5}, {"review": "Beautiful cabin only a few minutes away from hiking, skiing, and great restaurants! Corey is an excellent host and provided great recommendations.", "rating": 5}, {"review": "Corey's place was exactly as described and what we needed! A perfect place to relax with the pup and chill out in the hot tub. Would love to go again!", "rating": 5}, {"review": "My son and I had a great stay at this cabin.  We loved the loft and felt comfortable in the space.  We had a campfire every night and appreciated that there were chairs already there by the fire.  The hot tub was the best!  The temperature was easy to adjust and it was great to be outside and warm even if it was raining while we were there.  Lastly, we appreciated the fully fenced back yard.  It made us feel relaxed about having our dog be with us outside.  This place would be good to visit in the summer.", "rating": 5}, {"review": "We had a wonderful stay at Cory’s Airbnb. It was so cozy and relaxing. The hot tub was perfect after a day of snowboarding! Very cute and clean place, would highly recommend and would go back again. Thank you!", "rating": 5}, {"review": "The Mt. Hood Hutte exceed our expectations. Only being 30 minutes outside the city, we will definitely be back!! Thanks Corey!!", "rating": 5}, {"review": "Had a great stay here with my boyfriend and our pups! The fenced backyard was great for the dogs and fencing was secure all the way around. <br/>Everything looked like the pictures and was very clean. We had an awesome time and will be back I’m sure!", "rating": 5}, {"review": "Corey’s house was very welcoming. The house was clean and comfortable, the backyard was very relaxing. It was close proximity to restaurants and great hikes. The hot tub under the tree canopy was delightful!", "rating": 5}, {"review": "We enjoyed our stay!", "rating": 5}, {"review": "Corey is an amazing host with excellent local recommendations (from food to activities). The cabin was a great place to relax and a close drive to ski mountains. It had all the amenities we were looking for: great WiFi, functional kitchen, hot tub. Highly recommend for anyone looking for somewhere to unwind in nature!", "rating": 5}, {"review": "Beautiful ! Private back yard! Hot tube was killer. Ohhh and the smell inside totally worth staying just for the smell of the place !", "rating": 5}, {"review": "Beautiful cozy cabin! Corey was a super helpful and responsive host. Loved the hot tub and the surrounding nature is lovely.", "rating": 5}, {"review": "The only complaint I have is that I’m not rich and can’t stay forever :) I vote in favor of Corey training all new airbnb hosts on how to run an amazing place to stay. So much thought was put into every detail of the house. We had every single thing we needed to have a relaxing few days with our pups. Corey reached out to make sure we had everything needed, made recommendations on the best places to eat near by, and the best trails and activities in the area. We’ve stayed at so many short term rentals and none have come even close to being as awesome as this home was. He also didn’t make us do a bunch of crazy chores before we left, which we have NEVER come across. I almost don’t want to share with everybody how great this place was, because we want to come again and don’t want it to be all booked up :-D", "rating": 5}, {"review": "This cabin was exactly as advertised and a wonderful stay! It was clean, cozy, and made for a truly enjoyable and relaxing getaway. It was clear the hosts have put a lot of thought and effort into creating an enjoyable space. The place is very pet-friendly, and my pup really enjoyed the fully fenced backyard! I would stay here again in heartbeat and have already recommended this place to friends and family.", "rating": 5}, {"review": "Had a wonderful, relaxing time! My dogs loved playing in the fenced yard! It was very dog friendly, even had nice raised bowls for them. The bed was very comfortable and big. Everything was clean and inviting. Can’t wait to stay here again!", "rating": 5}, {"review": "This was our 2nd stay at this location. Somehow it was even better than the 1st time we stayed. Fantastic location for a calm, centering, and beautiful getaway. Corey is an exceptional host.", "rating": 5}, {"review": "Highly recommend this place to stay!! Such a warm inviting cabin and close to all the outdoor adventures! We had a wonderful time and hope to stay again in the future! Corey was a very responsive host and appreciate all the communication surrounding our stay!", "rating": 5}, {"review": "Our stay at Corey’s place was everything we had hoped for during our trip: a cozy, peaceful getaway that was accessible to winter activities while offering a relaxing retreat to come home to. We really enjoyed the hot tub and wood stove, and we loved the extra touches like cozy blankets and food bowls for our two dogs. The cabin was even more spacious and comfortable than I had been expecting, and we really enjoyed cooking meals in the kitchen (we also had takeout from Naan n Curry one night—delicious!). Finally, Corey was a super-communicative and helpful host. We will absolutely be back!", "rating": 5}, {"review": "Cutest little house! 10/10 would recommend. Super convenient to the mountain 🏂. Corey had a ton of recommendations and was super easy to communicate with.", "rating": 5}, {"review": "Perfect", "rating": 5}, {"review": "Corey was great, communicated really well and was very hospitable. My family loved the house and felt very welcomed!", "rating": 5}, {"review": "Easily one of my favorite all-time Airbnb rentals to date.  Between the hot tub, wood fire place and all of the other thoughtful amenities, this place is a total Gem! Top-tier host as well.", "rating": 5}, {"review": "This place is better than even described, we felt right at home and had everything we needed! Corey was an amazing host and very responsive. Our dogs loved the fenced yard, and we had all the privacy in the world. It was exactly what I would want a cozy cabin experience in the woods would feel like, a perfect ski getaway from the city for the night. We will 100% be back to stay here!", "rating": 5}, {"review": "Second time staying at Corey’s place and it was perfect again. Must do!", "rating": 5}, {"review": "Awesome cabin, very unique and great amenities. A great place for a couples retreat or a small family. Very close to local Ski Resorts.", "rating": 4}, {"review": "The Hutte was an extraordinary setting for a romantic getaway. Cozy, delightful wood stove, hot tub, essential amenities. Highly recommended winter stay on the mountain whether skiing or not.", "rating": 5}, {"review": "Our second stay at this cabin.   We are totally enamored with it.   Cozy and private.   Good vibes all around!", "rating": 5}, {"review": "We loved staying at Corey's home so much we were talking about how soon we could book another stay before we even left. The home was cozy, and our pups loved the fenced-in yard.", "rating": 5}, {"review": "Great spot, our dog loved the backyard. we will deff be back.", "rating": 5}, {"review": "Had a wonderful time at the Cabin! Our dog felt right at home! The hot tub and fire place were warm and comfortable. We appreciated the safety precautions! And we appreciated no fireworks over the New year holiday which resulted in a stress free vacation for us!", "rating": 5}, {"review": "Corey was a great host and the cabin was wonderful! Highly recommend for a cozy getaway, and for easy access to the Mt Hood area. The woodstove was unfortunately out of order when we were there, but Corey let us know ahead of time. Other than that, the cabin was perfect for our holiday weekend with our pup.", "rating": 5}, {"review": "A very nice 3 day getaway for my family. Very clean home. Comfortable upon arrival. Nice backyard for the dog. Clean hot tub. The ambiance was just what I was hoping for. Corey was very kind, and helpful when we had a little issue. Very quick to respond. Perfect location for quick trip to local restaurants, hiking, Government Camp and Timberline.", "rating": 5}, {"review": "The home is adorable, cozy, and exactly as advertised. It was a nice private weekend getaway to relax. Thank you so much!", "rating": 5}, {"review": "It’s amazing. Beautiful space. Doesn’t get better than that.", "rating": 5}, {"review": "Corey's cabin was everything you'd want for a weekend (or week if you're lucky) up in the woods. Peaceful, nostalgic decor inside and out, cozy and perfect for apres-ski (or just hanging out in the rainforests of Oregon!)<br/>Everything was great from start to finish, and I'd highly recommend Hutte Mount Hood if you're looking for a great place to adventure from!", "rating": 5}, {"review": "Wonderful time and we will definitely look forward to going back sometime", "rating": 5}, {"review": "This was one of our favorite getaway weekends. We were pleasantly surprised by how perfect this place was. We are  already planning on returning to this cabin. Highly recommend!", "rating": 5}, {"review": "Book this cabin if you want the perfect Mt Hood escape.   This place is incredible.  Very thoughtfully designed and oh so cozy inside and out.   There are neighboring houses but this place is so well laid out that it provides the upmost privacy.   The upstairs indoor glamping was super amazing and unique.   We loved the hot tub and cozy family room with the woods stove.   Will definitely book this again and highly recommend!!!", "rating": 5}, {"review": "This is truly an enchanting place to visit. Corey has created an environment that is equally cozy and peaceful. <br/>The backyard reminds me of fantastical wonderland- with the old growth trees and Edison bulbs. It’s hard to think of anything but nature when you’re there. Especially when it’s drizzling. <br/>The cabin itself is wonderful.  It was definitely designed with comfort and relaxation in mind. We felt very at home with all the throw blankets and candles! It doesn’t feel like a temporary stay. It feels like visiting an old friend, haha We loved it so much, we actually tried to extend our stay! But this place is a gem and books up quickly! We will definitely be back. I highly recommend it!", "rating": 5}, {"review": "Corey was a fantastic host! The cabin is incredible: pristine cleanliness, great amenities, and peaceful surroundings. Excellent communication throughout and a perfect getaway! 10/10", "rating": 5}, {"review": "Our stay at Hütte Mount Hood was absolute bliss! It’s a beautiful, well appointed space (with a delightful dose of whimsy inside and out). <br/>Corey was responsive, engaging and eager to support our cozy-cabin-in-the-woods birthday mission. 10/10 would recommend! Thank you, Corey!", "rating": 5}, {"review": "My little family needed a break.  This cabin was great.  Beautiful area.  Great amenities.  We will definitely be renting here again.", "rating": 5}, {"review": "The cabin was absolutely beautiful, clean, and very accommodating. There were clear instructions on how to work the wood stove and hot tub, and the overall vibe was very cozy and calming. Great location for hiking, nearby stores, and fun. I would 100% stay here again!! The only issue we had was getting in and out of the parking due to the tiny street and not wanting to pull into the neighbors driveways. Other than that, this cabin was truly a magical mountain paradise!", "rating": 5}, {"review": "This was my second stay at this cabin and I am still absolutely in love with this location! It is an incredibly peaceful spot to just hang out on a porch or sit in front of a fire. Corey is also a phenomenal host!", "rating": 5}, {"review": "This place is a great get away tucked in Mount Hood National Forest.  The backyard area is fenced in, so makes it feel private. The decor inside and outside are FairyTale charming. It also has a touch of modern decor mixed with rustic charm and romantic lighting. The energy feels like the heart of the forest and a bit whimsical. Great for a romantic getaway in nature. The place is clean and host is a great communicator. Can tell a lot of love is put into their cabin. Very quiet area and felt at home here. Totally want to come again!!", "rating": 5}, {"review": "My partner and I had an amazing weekend at Corey’s cabin! The outdoor space was perfect for us and our dogs and we enjoyed the cozy fireplace in the evenings. We would highly recommend this location for a weekend away in the forest!", "rating": 5}, {"review": "Easy to find, easy to get in, spotless, private, quiet, comfy. Exactly what we were looking for. This visit was only for two nights...next one will definitely be longer. Thanks, Corey.", "rating": 5}, {"review": "A great little place nestled away in the woods. Older cabin but all the important things have been updated with modern amenities - has everything you need. Close enough to the highway to be near the restaurants and such but far enough away to have basically no traffic and be nice and quiet. Hope to be back sometime when it's not raining! :)", "rating": 5}, {"review": "We had a wonderful experience here. The cabin was spotless and welcoming, with a lot of homey and unique touches. We enjoyed a few of the hikes suggested in the guidebook, as well as some relaxing soaks in the hot tub. There is a new fire pit which would be perfect in dryer weather. The fenced yard was great for our dogs. It’s now on the lists of our favorite Airbnbs. We highly recommend it for anyone visiting  the Mt. Hood area.", "rating": 5}, {"review": "Me and my husband stayed here on our honeymoon and it was amazing! The cabin was so cozy and stocked with everything we needed! Corey was super nice and recommended us restaurants and things to do nearby the cabin. Would definitely stay here again!", "rating": 5}, {"review": "Very cozy, kid and dog friendly place. It felt like a home away from home. Definitely recommend staying at this cabin!", "rating": 5}, {"review": "The cabin is adorable, clean, comfortable and well stocked with thoughtful extras such as board games, dog dishes and firewood for the wood stove. We enjoyed the beautiful fenced backyard and wouldn’t hesitate to return again for a relaxing forest getaway. Thank you for sharing your peaceful cabin with us. We had a wonderful and relaxing time.", "rating": 5}, {"review": "Had a lovely time at this cute cabin! It's clean, well thought out, a great value, and makes for the perfect quick escape from Portland. Would definitely come back again.", "rating": 5}, {"review": "Great for a weekend getaway! Corey gave us a list of recommended activities and places to eat. He also had some hiking books that came in handy! Cabin was quite and peaceful. Will definitely be back in the summer !", "rating": 5}, {"review": "Looking for a getaway in the mountains? Look no farther this cozy cabin in the woods is perfect for a peaceful stay! Hot tub under the trees, crisp mountain air, adorable cabin, and great hikes near by!", "rating": 5}, {"review": "You don't need to look anywhere else. This cabin was perfect for my wife and I, but would have been great had we brought the kids and dogs.  They really have thought of everything that you could need, yet it's uncluttered, very cozy.<br/>You can tell the cabin is cared about, and not just an investment property.", "rating": 5}, {"review": "I want to keep this place a secret because it's such a lovely AirBnB! The loft is super cute, everything well designed and very functional and comfortable. Can't say enough good things about this lovely space and bookmarking it for future trips to the area.", "rating": 5}, {"review": "Corey‘s cabin is very cozy. It had all amenities that we needed. The back deck felt very inviting and had a beautiful set up for the hot tub. The bed and couch were comfortable too. We wished we could have stayed longer. Corey was very helpful in all the steps of the experience. We can tell that Corey really cares about guests having a good time in the Hutte. Cheers!", "rating": 5}, {"review": "Good place.", "rating": 4}, {"review": "This place is beyond magical and my family felt right at home the moment we arrived! The home is beautiful with all the amenities you could think of and more. We loved all the games, the apple tv which was fun for scary movies at night, and the hot tub which was perfection. This home is the perfect getaway, allowing you close access to some incredible outdoor wonders, I highly recommend. Thanks Corey, can’t wait to visit again soon!", "rating": 5}, {"review": "Perfect little cabin in the woods, plenty of little thoughtful touches that make the place awesome! The loft bedroom is a wonderful idea, thanks for sharing!", "rating": 5}, {"review": "We had a wonderful time at this cabin! Everything was exactly as described and as seen on the pictures. The location is perfect, such a private spot! The cabin itself is equipped with everything you could ask for and the interior is really beautiful. We also enjoyed our time in the hot tub an the hammock, this was so incredibly relaxing! <br/>A great place for visiting Mt Hood, close to so many activities. Thanks to Corey for creating this magical place and hosting us!", "rating": 5}, {"review": "Cozy and quiet place to relax for a few days. It’s what we needed for a quiet weekend away from the city. <br/>The kitchen had the cookware essentials we needed for a few days of cooking and baking. Parking is on a hill and can be hard to get out of. Overall really nice place.", "rating": 5}, {"review": "We loved our time in the cabin! It was an excellent, peaceful place to retreat. Well put together, thoughtful touches throughout and very easy to get in and out of. Will be back!", "rating": 5}, {"review": "I highly recommend this cabin for a getaway in the mountains! The cabin is very comfortable, and it has such cute personal touches. Corey is a great host and will provide all the information you need! We will hopefully be back to enjoy it more", "rating": 5}, {"review": "Adorable place. Great aesthetic. Wish we could stay more than one night.", "rating": 5}, {"review": "We spent a LOVELY three days at Corey’s cabin in late August. We got some fall weather which made this cozy cabin even more dreamy. The place has been beautifully updated but has kept it’s rustic charm. The lighting throughout the home is thoughtful and really made the woodsy cabin ambiance I was looking for. The hot tub was clean and well-maintained and was a perfect addition to our romantic getaway. While there are a few houses nearby you would never know it while lounging in the backyard as the fences block our everything but the surrounding trees. The lights in the backyard made the whole place look so inviting when we showed up. We only slept in the downstairs bedroom but the bed and linens were SO comfortable. The instructions for everything in the house were super clear and Corey was probably one of the most responsive hosts I have ever interacted with. Check out was so easy with no long list of chores. It felt like Corey genuinely cared about us having a good time.", "rating": 5}, {"review": "We LOVED this Airbnb. First, even before we got there Corey was giving us all sorts of going recommendations with our pups for our time in the area, super helpful when you’re not from the area. We got to the Airbnb a little late, the lights were left on so it was super easy to find. The home itself is BEAUTIFUL. You can tell they put a lot of thought and effort into the design of the home. We loved all the thoughtful touches like the old fashion board games, outdoor corn hole, well stocked matching kitchen, coffee creamer, a few hiking snacks, even dog bowls. It was perfect. Our dogs LOVED the outdoor space with a fenced large back yard and patio they ran for hours. Plus the hot tub was great for us humans. Anyways, 10/10 would recommend and we’ll definitely be back! Thanks Corey!", "rating": 5}, {"review": "Best host I’ve had in along time, was the perfect get away for me and my love and our puppy. This will be a repeat visit", "rating": 5}, {"review": "We had a great stay at the cabin. Corey and his team did a fantastic job making the cabin feel some homey and comfortable. Fantastic wood smell, very nice decor, and great backyard with an amazing hot tub. The bed and bathroom were also great and we were very comfortable sleeping and hanging out at our cabin. Corey was great with local recommendations for food and hiking trails. We miss our time at the cabin and we would definitely consider booking it again in the future! Can't imagine how wonderful the cabin would feel during the winter time with the fireplace and the hot tub. Also can't beat the proximity of the cabin to some premier Mt Hood ski resorts!", "rating": 5}, {"review": "Amazing place for a getaway! Looked just like the pictures, very cute and well decorated. Our pup loved the fully fenced backyard and we loved the hot tub! Being in a secluded area but near other cabins made it feel safe, great location still near to food spots and not too far from the town. We had a great stay!", "rating": 5}, {"review": "The place is exactly as described. Beautiful interior and lovely outdoor space for hanging out. Quiet area with great hiking nearby!", "rating": 5}, {"review": "This cabin was one of the best places I’ve ever stayed. Clean, cozy, well decorated. Beautiful, peaceful backyard area with lots of trees. Waking up here felt like a dream. I would love to come back and stay longer. Additionally, Corey was an incredible host. He provided recommendations for local hikes, clear instructions for everything, and responded quickly. 10/10 stay", "rating": 5}, {"review": "This place is awesome. Very comfortable and private feeling in a great location. The cabin is very clean and well kept inside and outside. We really enjoyed all of the little touches throughout and has everything you want in a modern mountain cabin. The hot tub was great after a day of hiking and spending time around Mt. Hood!", "rating": 5}, {"review": "Really wonderful stay.", "rating": 5}, {"review": "Highly recommend! Beautiful cabin, modern features, comfortable bed, good communication. 10/10", "rating": 5}, {"review": "Host provided excellent instructions for check-in and activities for the surrounding area.  Perfect location for all of  Mt Hood activities,  yet secluded enough to enjoy the outside space as if you were in  the middle of nowhere.  Cabin was very cozy, and the pictures were accurate. The modern spa like shower was a perfect touch after being outside all day.   Will be staying again.", "rating": 5}, {"review": "We had a great stay at the cabin - The hot tub was our favorite part after a long day of hiking.  The interior is beautifully done and quite cozy.  One of the nicest AirBnB’s we have stayed.  Thank you!", "rating": 5}, {"review": "Beautiful little cabin in a wonderful location!", "rating": 5}, {"review": "Corey delivered as promised! Would recommend", "rating": 5}, {"review": "We had one relaxing evening here. I wish I could of stayed a week. It’s a beautiful comfortable cabin. We enjoyed sitting in the hot tub at the end of the day.", "rating": 5}, {"review": "Exceptional. This place is a gem! It was the perfect weekend get away and honestly even better than the pictures. The place was so cozy and private. We had a wonderful and recharging weekend. The hammock and hot tub…chefs kiss. Corey is a fantastic host and was super quick to respond to all my messages. This is our new favorite place to stay up near Mount Hood!", "rating": 5}, {"review": "Absolutely one of the most thoughtfully put together rentals I have stayed in! The cabin itself is beautiful and has everything that you could need. The backyard with hot tub is a dream and is fenced in to create a private cozy environment. <br/>Corey was an incredible host and very easy to communicate with. He provided us an extensive list of recommendations in the area from hiking spots to restaurants, bars and grocery. Almost felt as if we had a personal concierge! He even provided us some great restaurant spots for our day in Portland before flying out. <br/>Worth the price and then some!", "rating": 5}, {"review": "Corey’s place was perfect for my husband and I and our pups. Excellent amenities, private backyard, and easy access to all Mt. Hood has to offer. We will be back!", "rating": 5}, {"review": "Completely charming Mt Hood cabin! Our family of three (one teen) and small dog felt right at home and enjoyed the space and couldn’t stop saying how cute it was. So close to great hikes, swimming, kayaking and Timberline so we could really pack it in. Terrific host and easy communication. Next time we hope to stay longer!", "rating": 5}, {"review": "This place is so wonderful!", "rating": 5}, {"review": "Beautiful cabin, gorgeous outdoor space. The cabin has been renovated beautifully. Despite being just off a road and next to a few other cabins, this place somehow still manages to feel peaceful and secluded", "rating": 5}, {"review": "This is one of the best Airbnbs I've ever booked. This place was super cute and we'll definitely be back", "rating": 5}, {"review": "Stay was amazing. The home is very clean, and has everything that you could need. It was perfect for the time we had it. And would definitely look into staying there again in the future. I cannot recommend it enough!", "rating": 5}, {"review": "This cabin was the best getaway I could want. It had everything I needed, from the great kitchen and living room, to the outdoor area and hot tub. Corey was an excellent host. He provided information on several local attractions and places to eat. In addition, he contacted me right away when some nearby construction caused a brief loss of power. If you need a relaxing vacation in the woods, this is the cabin to stay at!", "rating": 5}, {"review": "I recently had the pleasure of staying at this cozy Airbnb tucked away in the woods for the second time, and it was an absolute delight. As soon as I arrived, I knew my family was in for an incredible stay. The host has truly done an amazing job with this place!<br/>First and foremost, the amenities provided were outstanding. The hot tub was a perfect way to unwind after a day of exploring the surrounding nature trails. The indoor stove in the living room area added a touch of warmth and coziness, making it the ideal spot to relax and connect with loved ones. There’s even an outdoor pit. My 7-year-old niece loved the tent-themed upstairs bedroom, and my parents couldn't stop complimenting the place. It had everything we needed, even laundry detergent.<br/>The backyard was a private oasis, fully fenced in and beautifully lit with charming string lights. The host was friendly and quick to respond, making our stay even better. I can't recommend this place enough.", "rating": 5}, {"review": "This place was everything we hoped for and more! The cabin is so clean and decorated so beautifully! It provided the perfect getaway! The wood stove was so relaxing after a rainy day of hiking! The hot is also such a nice way to relax after exploring and hiking in the area! Corey gave us great recommendations of hikes and we had the best time in the Mt. Hood area! I would stay here again in a heartbeat!", "rating": 5}, {"review": "This place did not disappoint. beautiful surroundings and peaceful. I loved it here and it had many amenities that weren't listed, like coffee and creamer.<br/>I loved staying here and I am planning on going back in the fall.", "rating": 5}, {"review": "was a beautiful little spot, wish I stayed longer!", "rating": 5}, {"review": "Cute little cabin! great privacy, very clean and close to easy access to Sandy, Mt. Hood Meadows or Timberline. Just loved this cabin! The bed was super cozy and comfortable too, would love to have that mattress in my home. 10/10 would recommend and would come back!", "rating": 5}, {"review": "A little gem near mount hood and all that the area has to offer. Corey was a wonderful host. Very quick and detailed with responses. Even sent some very specific recommendations for activities based on my needs. The house is nicely tucked away in the trees and a fence, so though you are close to other homes it feels very quiet and peaceful. Super clean and tidy. The kitchen is well equipped and I hope to make it back another time with more time to cook. Big cozy beds and bedding :) The highlight for me was defining the hot tub!! It was hot when I arrived and easy to use. A great little patio makes the hot tub accessible and it was nice they provide towels. Literally a little slice of heaven.", "rating": 5}, {"review": "It was a beautiful spot, nice, clean and private.  Corey was very friendly and informative. There was plenty of cookware to make yourself meals. It was a lot of fun and a super relaxing stay.", "rating": 5}, {"review": "Beautiful home! You can really tell they’ve put a lot of thought and effort for the people who will be staying there! Gorgeous place and the hot tub was sublime! Full kitchen, there’s a laundry with washing machine and dryer, and decent sized living/dining area. <br/>There’s no window coverings for the kitchen or living room windows closest to the fence next door, but it does feel private enough. I had wanted some peace and quiet, and I definitely got that while staying at this listing. <br/>Highly recommended!!", "rating": 5}, {"review": "Beautiful place , would recommend.  Amazing host,  he was very helpful and responsive .", "rating": 5}, {"review": "We really enjoyed our stay here! Everything was as described/pictured and the fenced in yard was great for our dog and very secure.", "rating": 5}, {"review": "Had a great time. Everything is exactly as described and very clean. We will definitely come back.", "rating": 5}, {"review": "Thank you Corey for your detailed instructions :) My partner and I were celebrating our 7 year anniversary and this place really delivered what we needed. A calm and relaxed cabin/ backyard. We loved sitting outside to drink our coffees, read and draw. The hot tub was clean and easy to use. It was perfect to use as the stars started to appear. One of my favorite parts of staying here was waking up to the birds singing. Definitely a place we would like to visit again in the winter :)", "rating": 5}, {"review": "Corey was a great host - He was very responsive to questions and provided detailed instructions of everything we needed to know about the reservations, including local activities in the surrounding area.", "rating": 5}, {"review": "Really wonderful place. Neighbors are nearby but the yard is fenced and private and full of huge wonderful trees. Loved the hot tub and fire pit, appreciated the abundant firewood. The house is lovely and comfortable, with a full functional kitchen. Our dog loved it too! Would definitely go back.", "rating": 5}, {"review": "My husband and I loved the cabin! Very cozy, comfy and homey. Fire place and hot tub is exactly what we needed for the rainy weekend.  Check in was extremely easy, everything was as described!", "rating": 5}, {"review": "We enjoyed our stay at Corey's place. It's easy to get to the place and access the self-lock. The place was very clean and organized, well equipped with everything we needed. There is a big backyard decorated with lights. The hot tub was great with a mountain view. Would love to come back!", "rating": 5}, {"review": "This home is a perfect slice of heaven. The backyard is so nice and just what we were looking for. The home had everything you could need and more. A perfect weekend getaway and I would 100% book again.", "rating": 5}, {"review": "This is the coziest place I’ve ever stayed at. The cabin had everything we needed and really easy instructions. The backyard is private and relaxing, and the hot tub alone is worth the stay. I wish I could have stayed longer.", "rating": 5}, {"review": "Corey was lovely! The house is off the grid and made the best place for a romantic get away!", "rating": 5}, {"review": "What a wonderfully decorated and comfortable cabin. We thoroughly enjoyed our stay. Hot tub was clean and in working order. The beds were comfortable. The tent room was adorable. There was plenty of wood to be chopped for the wood stove. The kitchen had all the tools we needed to cook dinner. The furniture was comfortable and stylish.", "rating": 5}, {"review": "He has all the necessities you would need and a lot of little extras that make you feel very welcome. Perfect peaceful retreat!!", "rating": 5}, {"review": "We love our stay. Such a beautiful, peaceful, private spot. We enjoyed the cozy cabin and exploring the surrounding area. Five stars for the Zig Zag Diner up the road! We would love to come back and stay here again.", "rating": 5}, {"review": "Corey was extremely helpful before and during our trip, the place was amazing and exceeded expectations", "rating": 5}, {"review": "Lovely cabin, beautifully decorated, homey feel, amazing backyard.  What more do you need??  Can't wait for another stay at Corey's place.", "rating": 5}, {"review": "We had the best time at this little cabin! We felt so cozy and at home, and so did our dogs!", "rating": 5}, {"review": "Stayed for a second time and this place is always a dream!! Thank you so much Corey, we are always so happy to stay here and can’t wait to come back.", "rating": 5}, {"review": "excellent place truly. Corey alleviated some of my fears of driving in the snow. fantastic location and host", "rating": 5}, {"review": "Amazing spot! Tucked away off Lolo Pass. Was fun enjoying both inside and outside the cabin. Super cozy and tastefully decorated. Wish we could've stayed longer.", "rating": 5}, {"review": "The cabin was very quiet and cozy.  The hot tub was wonderful, and everything was user friendly and simple.  Corey was a great host--very responsive and friendly.", "rating": 5}, {"review": "Wonderful!!! Corey's place was even better than we expected...and we expected it to be nice! The cabin was everything we wanted: cozy, welcoming, quiet, well-stocked, very clean, and charming decor. The wood stove worked like a charm as did the hot tub. We ate every meal \"in\" and the kitchen was stocked with everything we could wish for. It is obvious that Corey put a lot of time and thought into creating an amazing cabin experience in the woods. We would definitely return. 5 STARS!!! Thank you, for sharing this lovely space with us. :)", "rating": 5}, {"review": "The pictures do not do this lil cabin justice! The high ceilings in the living room made it seem so spacious. The cabin was super clean and had everything we needed. We felt at home away from home. Would definitely come back!", "rating": 5}, {"review": "Absolutely gorgeous little cabin - we eloped and spent a week here for a relaxing getaway and it was perfect! Quiet location and private backyard for enjoying the hot tub while letting the dogs sniff about. Comfortable and cozy interior, everything was extremely clean. Close location to restaurants and groceries. Also close to lots of trails - we will be back in the summer to explore the area more; especially since Corey was a very responsive and helpful host! (:", "rating": 5}, {"review": "Wonderful updated cabin close to Mt. Hood! We really enjoyed our stay. The enclosed yard for my dog and hot tub for relaxing while it was snowing was perfect. Super clean and roomy space.<br/>We'll be back!<br/>:)", "rating": 5}, {"review": "Great escape!", "rating": 5}, {"review": "Even better than the listing! Corey was a friendly, responsive host, and the cabin was beautiful, cozy, and surrounded by mountains and snow!", "rating": 5}, {"review": "Perfect for a quiet and cozy weekend! Corey’s place is beautifully done, thoughtful touches abound making for a comfortable stay in the mountains. We loved the privacy of the backyard for hot tubbing and the wood burning stove was a treat. Just the right distance from skiing, about 30 minutes from Tea Cup Nordic, away from the crowds. Still many restaurants and stores to choose from within 5 minutes of the cabin. Do not hesitate to book this place, it’s amazing!", "rating": 5}, {"review": "Corey's place was so cozy! We unfortunately didn't have great weather during our visit, but Corey was super responsive when we had concerns about the incoming storm! The cabin was perfect for a cozy snow day between the woodstove, a puzzle, and hot tub. Our dog enjoyed exploring the fully fenced backyard. Easy to get into town for groceries or a meal too.", "rating": 5}, {"review": "A cozy, cute and clean cabin! We hope to stay again’", "rating": 5}, {"review": "This cabin was a great little getaway and basecamp for some skiing at Mt hood. We enjoyed the wood furnace and hot tub and clean space. I would recommend it to anyone.", "rating": 5}, {"review": "We had an amazing time during our stay at Corey’s place! It was beautifully clean and had everything we needed for a relaxing getaway. Loved the space and location. Would absolutely stay again and recommend to others!", "rating": 5}, {"review": "Corey's place was wonderful. Great layout and use of space. Decor was charming, cabin was well equipped, and the hot tub was very relaxing surrounded by trees and strung lights. I slept up in the loft tent and if was delightful. Corey was very communicative and friendly. Recommend this place!", "rating": 5}, {"review": "Corey’s place was perfect for a quick ski getaway at Mt. Hood. The house is adorable and had everything we needed to feel at home. Highly recommend!", "rating": 5}, {"review": "Lovely weekend away. Thanks for allowing our pups to join us. We had a great time.", "rating": 5}, {"review": "Excellent mountain getaway!  Booking my next stay right now!", "rating": 5}, {"review": "We enjoyed our stay here and will definitely be coming back. The cabin was perfect!", "rating": 5}, {"review": "Corey’s place is adorable! Looked even better in person. We had a very relaxing time and the stay was extra cozy with a fire and dip in the hot tub. He communicated very effectively, no surprises and all helpful instructions. We appreciated the coffee provided and the cute touches throughout the cabin.", "rating": 5}, {"review": "This place was perfect for us. 20 min from mt hood activities, it was quiet, peaceful, nice hot tub and I loved all the finishing touches of the cabin. It was very clean and well put together. The little nook/extra bedroom upstairs is a nice touch too. I would definitely recommend this place to anybody looking for a quiet, mountain getaway. It had everything we wanted and more.", "rating": 5}, {"review": "Excellent stay! The cabin is so peaceful and relaxing. Definitely planning to return!", "rating": 5}, {"review": "Corey’s place was exactly as pictured. The house is cozy and clean. The backyard is a great place to unwind and relax with the hot tub. The house has everything you need to from coffee in the morning to a puzzle and games in the evening. Corey is a wonderful host- he communicated everything we needed, provided local recommendations, and was responsive any time we reached out. We hope to be back soon!", "rating": 5}, {"review": "Wonderful, comfortable stay and beautiful surroundings!", "rating": 5}, {"review": "Our family of five (including our pup) loved our stay at Corey’s cabin! The cabin was clean, organized, and convienently located! Our eight year old daughter especially enjoyed the little loft/tent space :) Skibowl is a quick 10-15 min drive and timberline 25min w/o traffic. Plenty of good food around as well. <br/>Corey was very communicative and friendly if we had a question. <br/>We will be back again, thank you again and Happy New Year!", "rating": 5}, {"review": "The cabin was cozy and lovely.  We loved the lofted \"tent\" bed... and we are in our 60's.  It is perfection with view outside - clever, peaceful, comfortable!<br/>The cabin has been updated with care and the finishes are well suited to the space.<br/>Very enjoyable, clean and beyond comfortable with many elements to help guests feel welcome.", "rating": 5}, {"review": "Adorable cabin in the woods. Feels very private. Lovely wood stove and all amenities needed. Easy self check in. Cabin was even cuter than the photos!", "rating": 5}, {"review": "Such a beautiful and amazing place to stay in, it felt so comfortable and was an  enjoyable space to be in with everyone!! The cabin has such a cozy atmosphere and was exactly the cabin experience we were looking for as a family with young kids. We will definitely have to be back - Thank You!!", "rating": 5}, {"review": "The pictures didn't do it justice. Was very clean and super cute. Had anything we needed and a very well furnished kitchen. We had a great relaxing time. Didn't use the hottub because it was nasty weather. There is always next time. Very cozy felt welcoming! I would definitely recomend it. Thank you Corey!", "rating": 5}, {"review": "Great location, great host, great home, super cozy and updated. Definitely will be coming back again.", "rating": 5}, {"review": "Nice cabin, great hot tub, would definitely stay again!", "rating": 5}, {"review": "This place is AMAZING! Corey has done a phenomenal job with renovations and updating. The place was super clean and ready to go. The hot tub was perfect and the wood stove added so much to the experience. A huge thanks to Corey for a wonderful stay!", "rating": 5}, {"review": "Such a nice getaway! I would definitely stay again.", "rating": 5}, {"review": "The ultimate cozy getaway cabin! Enjoyed the wood burning stove and back yard for our pup. Hot tub was also a nice relaxing touch!  And great food recommendations near by. We will def be back! 🥰👌", "rating": 5}, {"review": "Corey’s place was amazing. What a wonderland of a winter escape. You really can’t beat it. You can tell how meticulous Corey was in the details of the cabin!", "rating": 5}, {"review": "What a great stay we had here! I can’t say enough good things. The fenced yard was perfect for our dogs and felt so secluded, the hot tub and outside lighting was amazing and we loved it so much! The cabin was equipped with everything you could ever need and the bed, linens, and couch were all super comfy. Loved being cozied up by the wood stove and having Apple TV that allowed you to stream your favorite shows! The shower was also very nice and honestly everything about the place is just wonderful. Corey is an amazing host and now I want to make this an annual trip. Thank you!", "rating": 5}, {"review": "Lovely, peaceful cabin in a gorgeous location. Had a wonderful & cozy visit and enjoyed exploring the surrounding area.", "rating": 5}, {"review": "So much better than expected. Loved the fenced yard. The whole place was perfect. If you ever want sell it give me a call!", "rating": 5}, {"review": "We had the best time at Corey's cabin with our dogs. The cabin was so cozy and peaceful! It was an amazing place to getaway for my birthday. It had a private yard for the dogs, an outdoor fire pit and the hot tub was a lovely bonus. The wood stove and adorable upstairs sleeping area made the cabin unique. It was a perfect location near plenty of restaurants, a grocery store and many areas to hike at Mt hood. Corey gave excellent recommendations, and was always quick at responding. We highly recommend this cabin and can’t wait to go back! Thank you Corey :)", "rating": 5}, {"review": "Beautiful, quiet, clean! Corey's cabin is the perfect get away!", "rating": 5}, {"review": "Comfortable, quiet, and clean. Great place to relax.", "rating": 5}, {"review": "I loved everything about this cabin and I can’t wait to go back! <br/>The place is the most cozy, beautifully decorated, the bed is extremely confortable And the yard with all those old growths trees is incredible. So relaxing, si special. Thank you Corey!", "rating": 5}, {"review": "One of the best getaway cabins we've found yet! Such an awesome place with the best atmosphere and we loved how close it was to all the hikes we went on and Mt.hood. Wifi was spotty throughout the stay but all the more to unplug and ground yourself! Everything was amazing, thank you!", "rating": 5}, {"review": "Thank you for letting us stay in your gorgeous cabin. We will definitely be staying again!", "rating": 5}, {"review": "loved finding the led lights and all the comforts of home.", "rating": 5}, {"review": "All around a lovely experience, so cozy! Would definitely stay here again!", "rating": 5}, {"review": "We had a wonderful getaway at Corey's cabin!   The cabin is comfortable, beautifully decorated, romantic, cozy, and thoughtfully appointed with helpful touches.  We loved the wood stove, the private and romantic hot-tub in the back yard experience, and the lighting throughout the cabin and backyard.   Corey was quick to respond to any questions we had.", "rating": 5}, {"review": "This cabin was the cutest place in Oregon. My bf and I stayed there for a week and we couldn't have asked for a better place. The cabin had everything we needed and there were so many cute little details that we fell in love with. Communication was great with Corey and he made sure we were enjoying our time and everything was running smoothly. We will definitely be coming back next time we are in Oregon!", "rating": 5}, {"review": "Cozy, comfortable, clean, and cute cabin in the perfect area near Mt.Hood. The hot tub and wood burning stove were perfect touches. Private fenced yard was perfect for the dogs. It was very private and quiet. Honestly a dream home of mine and hope I can stay again!", "rating": 5}, {"review": "This cabin is absolutely fantastic and so is Corey. The location is perfect and super easy to find. As well as being very close to things to do/places to eat. There was so much privacy as the other cabins are decently far away from you. Corey was more than helpful and kind the entire time. The cabin itself is lovely with amazing decor, like straight out of a magazine decor. If you’re someone who appreciates aesthetics this place will be perfect for you. Also the hot tub was aamazing.", "rating": 5}, {"review": "Super cool place we will be staying there again", "rating": 5}, {"review": "My partner and I had a phenomenal stay at Corey’s cabin. It was the epitome of rustic elegance. The overall design and attention to detail of the house itself was impeccable, and created a warm and welcoming environment. There were all of the kitchen appliances one would need, bedding and beds were very comfortable, lighting was perfect with tons of natural light from the windows, a large and gorgeous bathroom shower, fireplace, and stunning back yard with hot tub. We were also welcomed with a sweet surprise of hot cocoa, apple cider, and snacks. Directions for use of the home were clear and easy to follow. Finally, communication with the host was fast, as well as accommodating. We already booked our next stay before we checked out! An easy 5-star rating!", "rating": 5}, {"review": "My husband and I loved our stay here!!! There was plenty of space for the two of us and our two pups! The interior is beautifully done! We enjoyed having access to an enclosed yard space where our pups could roam freely while we played a game of corn hole and relaxed in the hot tub. The kitchen also had everything we needed to prepare a light breakfast and some snacks.", "rating": 5}], "35383307": [{"review": "Susan’s cabin was an awesome place to stay after a long day hiking around Mt. Hood. A great retreat!", "rating": 5}, {"review": "Excellent! We had an amazing time. Bring your own TP if you aren’t a fan of 1 ply ;)", "rating": 5}, {"review": "This location is absolutely beautiful!  The cabin was perfect!", "rating": 5}, {"review": "We had a great stay! The cabin is beautiful and perfect spot for a weekend getaway.!", "rating": 5}, {"review": "We had a wonderful time. The space was cozy, well-appointed, and felt like a true home away from home. We especially appreciated the comfortable bed, natural linens, the well-equipped kitchen, and peaceful and private romantic location in the forest. Its convenient location made exploring the area easy.", "rating": 5}, {"review": "We had a great stay at Susan’s tiny house. The place is exactly as described. Cozy, private and had everything you need for a night or two. Read instructions provided to the location carefully and be prepared to lug your belongings up the gravel hill!", "rating": 5}, {"review": "Absolutely adorable cabin that was so peaceful and serene. Beautifully decorated and private. We enjoyed sitting on the front porch to drink our coffee in the morning as we listened to the birds. Twinkling lights strewn throughout the outdoor area was so cozy in the evening as we sat outside. Fire ban was in place unfortunately, so we weren't able to enjoy the fire pit area. Next time! Really wished we could have stayed longer than one night! Perfect location for our visit to Mt. Hood -- lots of amazing hikes in the surrounding area. We enjoyed the Mirror Lake Trailhead nearby. Hope to be able to return some day!", "rating": 5}, {"review": "We booked this on our PNW Honeymoon trip and it couldn't have been more perfect. It was secluded, relaxing, and downright charming. My wife couldn't contain herself, I feel that this location is just about every woman's fantasy haha. Just a perfect slice of uber green paradise.", "rating": 5}, {"review": "We loved staying here! It was more magical than we thought it would be. The view framed by the large living room window was incredible! It felt like the cozy cabin we needed.", "rating": 5}, {"review": "Lovely place to stay,  the description is accurate for what you get (ie steep driveway, ladder to the loft bedroom). My partner and I really enjoyed the area being a little more secluded and quiet. Great place for unwinding after a day of hiking and maybe some fruit picking near Hood River.", "rating": 5}, {"review": "Susan's tiny cabin was an amazing getaway for my wife and I in the midst of our Oregon trip. It's got just about everything you need and is exactly the experience you'd hope from a secluded cabin that's not too far off the beaten path. The driveway is no joke, so plan accordingly if you can't make it up in your vehicle!", "rating": 5}, {"review": "This was a great getaway. Right near Mt Hood village so the stores were quick to get to. Definitely need a AWD/4WD to get to the tiny house because the hill is steep. We used a 2012 Honda pilot and it did perfectly fine. It felt like we were the only house there because of the hill so while it was close to a lot of things it still felt very private. The grill outside was easy to use and it allowed us to cook some meats rather than use the electric stove inside so we wouldn’t stink up the house. The pictures are all accurate. Just needed some things from the store like cooking oil and some fire starter kits but that was very easy to get. As long as you read instruction for how to get there you’ll be fine! I will say, and I don’t think this is the house’s fault, but the mosquitos/flies/moths would find their way into the house every time we had to open the door . Other than that it was perfect.", "rating": 5}, {"review": "We enjoyed our stay so much, the cabin is well appointed and “feels like home”. It’s a beautiful setting and very relaxing. This was our 2nd time. We look forward to future stays! Susan is a great host!", "rating": 5}, {"review": "This little cabin is off the beaten path, but beautiful once you find it! It was the perfect getaway. A hammock in the woods and a giant window in the cabin by the couch, it was a reader's paradise!", "rating": 5}, {"review": "Great cozy cabin, close to many hiking trails. Loved the laundry machine!", "rating": 5}, {"review": "this is the perfect private and relaxing location to decompress", "rating": 5}, {"review": "We loved staying at Susan’s place! It was very easy to find and very comfortable to stay for a relaxing weekend! Will definitely visit again!", "rating": 5}, {"review": "Incredible secluded place to stay that is a perfect home base for all the hiking in the Silverton-Mt. Hood area. I loved that the cabin was above the main property, allowing for total privacy. Susan was very nice and responsive. Would recommend to anyone who loves being tucked into the woods and doesn’t mind paying 5-star hotel price.", "rating": 5}, {"review": "This place is amazing! Me and my fiancé took some engagement photos by ourselves here and they turned out amazing. The fire pit was nice and the nature all out felt very peaceful and quiet. This trip was peak relaxation. it's a little costly for me, but it was great for a special occasion. The road up to the cabin is very bumpy and has a steep driveway to walk up, but if that's not an issue, everything is amazing!", "rating": 5}, {"review": "Perfect tiny home for a quick overnight before a climbing day on Mt Hood. Susan was super responsive, the location was convenient from Hwy 26 yet felt secluded and quiet. Thanks for a great stay!", "rating": 5}, {"review": "Susan is a great host!. We enjoyed the stay , her place is amazing. Everything she described and more. We hope to be back .", "rating": 5}, {"review": "Such a lovely space! It was so gorgeous in the deep woods on the mountain with glorious green surrounding us. Very peaceful and super close to a really fun restaurant with live music. and not enough can be said about the glorious mountains, hiking paths. waterfalls and more in the Historic Mt. Hood. Susan was a fantastic host and we felt very comfortable and at ease.", "rating": 5}, {"review": "A very private and cozy cabin in the woods. We enjoyed it very much! It's clean and feels spacious for a tiny house. The communication with Susan was great and we would really recommend this place!", "rating": 5}, {"review": "We had an amazing stay at this cozy cabin in the woods! As busy, fast-paced New Yorkers, this was the perfect place to slow down and truly relax. The peaceful environment, surrounded by nature, gave us exactly the kind of escape we were looking for.<br/>The cabin was clean, comfortable, and thoughtfully stocked with everything we needed. It had a fire pit, hammock, stove, TV with a DVD player, and even a great selection of board games that made our nights in really fun. Heating and AC were also available, which was a big plus given Oregon’s unpredictable weather.<br/>The host was incredibly friendly and understanding, and the surrounding area was beautiful, with lots of local trails and great restaurants just a short drive away. We couldn’t have asked for a better balance of quiet seclusion and nearby activities. We’re already looking forward to coming back! Thank you Susan!!", "rating": 5}, {"review": "Great spot!!!", "rating": 5}, {"review": "Susan was incredibly accomodating and friendly, helping us find our way around.<br/>Magical cabin :)", "rating": 5}, {"review": "Lovely stay very secluded. During our stay the laundry machine didn’t work no matter what we did, hopefully that gets fixed for next guest. And the shower only gives enough hot water for a 10 min shower before all hot water is lost so use sparingly! Other than those two in inconveniences Susan’s place was super chill and had some cute TASETY restaurants near by. And it was very close to a convenient store which was very useful. Would go back!", "rating": 5}, {"review": "Beautiful property and in a great location for hiking near Mt Hood", "rating": 5}, {"review": "Excellent spot for a trip out of Portland", "rating": 5}, {"review": "A little hard to find, but once there, a great, secluded location. <br/>Very cute tiny home!", "rating": 5}, {"review": "Such an incredible place to stay - this was our second time visiting and we hope to come back again!!", "rating": 5}, {"review": "It was so lovely and peaceful! And love the little wall mushrooms! Thank you!", "rating": 5}, {"review": "Amazing, peaceful, and cozy place. Had such a great time and loved having a campfire every evening", "rating": 5}, {"review": "This cabin was cozier than we could have imagined. It had all the necessary amenities for us and was impeccably clean. We immediately felt at home and the surrounding scenery was just gorgeous! We got to enjoy a rainy cozy weekend in this beautiful place. We will certainly be back!", "rating": 5}, {"review": "Susana place was a perfect getaway in the woods. Very private and a nice place to unwind. Very accessible to Mt. hood and a very beautiful little spot. I enjoyed my stay here and would love to come back again soon!", "rating": 5}, {"review": "Nice cozy little spot. Wood fireplace brought back memories of huddling around the stove in my parent’s cabin as a kid. 10/10.", "rating": 5}, {"review": "What a gem! A short commute to Mt Hood and nearby restaurants. The unit is perched on a hill giving ample privacy and quiet. Wood and fire starters were provided for the wood stove. Kitchen is fully equipped plus an all in one washer/dryer. High end decor and finishes in a well thought out and cozy space. Would 100% stay again.", "rating": 5}, {"review": "The cabin is very beautiful and cozy. Very romantic, warm and inviting. We came after some heavy snow so it was icy and even though we had an AWD with all weather tires we were not able to drive up the hill but we were able to park and walk up. She had a sled ready to help with our belongings. The hike up wasn’t bad and so worth it. It is close to ski resorts, grocery store and restaurants. We will definitely be back! Highly recommended!!", "rating": 5}, {"review": "Great, cozy stay. We braved the snow to get back there. Definitely want 4WD and a rugged vehicle. Even then, the snow and the condition of the road were a bit sketchy.  Otherwise, the stay was exact the low-key, relaxing weekend that we had hoped for!", "rating": 5}, {"review": "very nice space. Just what we were looking for, private quiet and ckean", "rating": 5}, {"review": "The driveway is very steep and since it was snowing we parked at the bottom and used their sled to haul our things to the house. I thought it would be inconvenient to do that, but it was so easy and convenient to be able to pull our things up the hill. The tiny home was PERFECT for a getaway and I hope to go back again! I wish I remembered a pen to write in their little review book but I will remember next time!! Overall it was an awesome peaceful weekend away!", "rating": 5}, {"review": "What a lovely little hideaway! Exactly what I needed to get away from my life for a couple of days and unwind. The home and area were beautiful and cozy and comfy. Everything was as-advertised and very pleasant.<br/>I was there when it was quite snowy and my 2WD vehicle couldn't get up the last couple of lanes, so I had about 1/4 mile to walk with my stuff. That was no problem for me, and enjoying the snow in my own cozy forest was 100% worth it, but depending on your mobility (or how much stuff you're bringing) you might want to rent or borrow something 4WD if you're going in snow season!<br/>Kitchen is tiny (it's a tiny house!) but had all the essential equipment to make a nice pasta and elaborate breakfasts. As advertised, there is no oven or microwave.<br/>As another reviewer mentioned, if you want to read in bed, bring a reading light.<br/>So cozy; I will totally go back next time I need a break from reality!", "rating": 5}, {"review": "We loved our long snowshoe weekend here. Susan was very helpful and responsive. Be sure to go to Skyway Bar Grill. Great food and live music!", "rating": 5}, {"review": "Really nice place, felt very comfortable. Just be careful of the stairs to the bed, they are very steep. Besides that it was a very pleasant stay.", "rating": 5}, {"review": "Good", "rating": 5}, {"review": "This was our second time staying here and we would definitely come back again! This little cabin is the perfect anniversary weekend getaway and is so close to the mountain as well as some awesome restaurants! We checked out Koya and went to Skyway for dinner and live music which was a ton of fun! Thank you Susan, we’ll be back! :)", "rating": 5}, {"review": "Can’t say enough great things about this spot! Loved the wood fireplace and cozy bed.", "rating": 5}, {"review": "This is hands down my favorite spot! Highly recommend! ⭐️ ⭐️ ⭐️ ⭐️ ⭐️ I always have my best sleep here.", "rating": 5}, {"review": "Lovely space, simple but well laid out. Cozy.", "rating": 5}, {"review": "Awesome place! Much needed get away from the busy city life.", "rating": 5}, {"review": "Our second visit here - we love the cozy (but modern) mini cabin. Used as a home base for skiing, so especially liked the small wood stove at the end of cold snowy wet days. So well designed as a space. We'll likely be back again!", "rating": 5}, {"review": "The cabin is in a quiet little neighborhood, it was a very cozy stay and only 15 minutes from ski bowl. There is a bit of a hike to get things in and out of the cabin if your car is two-wheel drive, but nothing we couldn’t handle. The cabin had everything we needed, but the toilet paper was single-ply, so consider bringing some of your own. Definitely recommend this spot if you’re looking for a quiet weekend and quality time with a partner!", "rating": 5}, {"review": "Very cute, cozy and clean.", "rating": 5}, {"review": "What a beautiful spot! Peaceful, cozy, and comfy.", "rating": 5}, {"review": "wonderful getaway from city bustle", "rating": 5}, {"review": "The Little House on the Mountain was a wonderful getaway. We were happy to see this cute cabin is just like what you see in the pictures, inside and out. It was very clean, comfortable, and attention to detail was noticeable. Susan was an excellent host. While we didn’t meet her in person, she was prompt, clear, and friendly in responding to questions I had prior to our trip. She provided an excellent experience. The overall location is great, and we enjoyed the privacy this property offered compared to many other rentals on the mountain. We hope to return someday.", "rating": 5}, {"review": "This was the perfect cabin. My boyfriend and I decided to do a long weekend away for Thanksgiving and Susan's cabin was private, cozy, and beautiful. We were able to just have a fire and sit and do nothing with quiet and incredible views. Not far from hikes/walking trails, Mt Hood and Hood River. Saw on the listing that there was only a stove, so only bought food we could cook on a stove top, and had no problems. Will definitely stay again when we are out this way in the future!", "rating": 5}, {"review": "Our stay at Susan’s was incredible! The cabin was tucked in the beautiful woods of Oregon. Very peaceful and cozy!", "rating": 5}, {"review": "Had a very relaxing stay in this tiny home. Easy access to hikes and nearby town. Would stay again!", "rating": 5}, {"review": "We loved the location and quiet. It’s close to some hiking and natural spaces. The layout was great, just be warned you have to climb what is basically a ladder to get to the bedroom loft area. So it’s a bit steep. Also the bed frame under the mattress was broken, making the mattress slope in the middle. The bed seems like it would be comfy if that was fixed.", "rating": 4}, {"review": "Susans place is beautiful and looks exactly like the photos, very cozy feels like surrounded by the forest.<br/>It was unfortunate that we arrived the Airbnb late at night and with limited data, so the check in process was frustrating under the rain and dark. Therefore I recommend checking in when it’s bright out for the best experience with Susan’s airbnb which it deserves!", "rating": 5}, {"review": "Another wonderful stay! We love this little getaway.", "rating": 5}, {"review": "I did not have a pen or I would have loved to leave a note in the extensive guest book. So many people have shared this in notes, drawings, journals: this is a wonderful place for so many reasons. It’s cozy, peaceful, and feels like home in all the right ways. I went by myself but would love to come back and bring my wife.", "rating": 5}, {"review": "We loved how nice and secluded the little house was! The way in is quite bumpy and the walk up is a workout, but once you’re inside it’s magical. There’s no microwave or oven so we heated food up on the stove. There were lots of cozy blankets to keep warm. 10/10 reccomend", "rating": 5}, {"review": "What a DREAM ✨ <br/>If you are looking to have a romantic getaway in the mountains this is the one! My husband and I visited Oregon for the first time to celebrate our one year of marriage and this tiny home was everything we wanted & more. Tucked away in the beautiful trees, this place was the perfect amount privacy and the perfect feeling of “off the grid” while being just minutes outside of town. We were close to several small towns and villages so anything we needed was easy to access (restaurants , groceries, gas, coffee shops etc AND in the heart of hundreds of trails). The furnace inside was the coziest little touch and we lit fire logs every night! The kitchen had everything you might need! We were only an hour outside of Portland and major landmarks so it was the perfect distance to make a days worth. Susan was an incredible host and really made this tiny house feel like home away from home(: this was a 10/10 vacation and this little home made it worthwhile! 🤍 Book it!", "rating": 5}, {"review": "I wouldn’t plan on cooking any meals at the place. It’s small, yes, but theres hardly anything to make a full meal with. Other than that,<br/>The home is peaceful, and relaxing. Great for one person who’s just trying to get away from all the noise in life. If you read, there’s only one place to sit where there’s adequate reading light, so I suggest bringing a reading light if you want to read in bed (which I lovingly referred to as “the nest” while there). <br/>I’d say, watching the leaves fall from the big tree in front and reading by the fire were some of my highlights while being there.", "rating": 3}, {"review": "This was the staple for our Oregon trip. BEAUTIFUL location, really does give you the natural Oregon feel. Made s’mores on the fire and played some board games in front of the wood stove inside. Highly recommend staying here! Might even rebook our stay for our next vacation. 1000000/10. Absolutely stunning.", "rating": 5}, {"review": "Perfect little getaway for my husband and I exploring Mt Hood area - it was a cozy and cute spot that was perfect for 2 guests! We would definitely stay there again if we came back", "rating": 5}, {"review": "The Little House on the Mountain was a PERFECT getaway for some much needed R&R. Admittedly, there's a lot to do in the area; amazing hikes, a trip to Timberline or a myriad number of outdoor activities but... we stayed in, made dinner in the cutie pie kitchen, stared out the AMAZING picture window, sat in the hammock (even though it was chilly), had a fire and soaked up the beginnings of fall. We highly recommend a stay if you're seeking peace and beauty. Thank you Susan!", "rating": 5}, {"review": "Susan’s place was a great spot to allow us to explore the surrounding Mt Hood wilderness; only a short drive away from restaurants as well as a few great hikes. Everything was clean and organized when we arrived and the house itself was very private and relaxing.", "rating": 5}, {"review": "Wonderful, cozy and peaceful. Everything we hoped for. Thank you for sharing such a welcoming, beautiful space.", "rating": 5}, {"review": "Cozy cabin tucked away among the trees. Close to a few places to eat, grab some groceries, and Mt Hood activities. Would gladly stay again! Great place to get away for a few days.", "rating": 5}, {"review": "This place!! I have now visited so many times that I playfully refer to it as MY cabin in the mountains. LOL … I adore this getaway into the mountains — such great proximity to lovely hikes and a delightful place to relax, have an indoor (or outdoor fire), and a great kitchen to whip up delicious meals.", "rating": 5}, {"review": "I needed a quick getaway spot for an overnight trip, that was peaceful. Susan's cabin was the perfect location. Out of town just a minute, by access using a standard mountain road- gravel, deep potholes, and tricky in winter conditions w/o AWD/4WD. Susan has a plan for everything! From parking to check- in, she is a fabulous host and has a magical cabin. I will definitely be staying here again.", "rating": 5}, {"review": "This space is adorable! It was so nice to be nestled in the woods and close to what Mt. Hood has to offer.", "rating": 5}, {"review": "Highly recommended! Clean, comfortable, private (as private as it gets!), all necessary amenities, great location for outdoors exploration and friendly/responsive hosts. The perfect cozy spot to return to sleep after exploring Mt. Hood. I had a super peaceful and pleasant experience here.", "rating": 5}, {"review": "Super cute tiny home, felt very private and secluded. The driveway is steep, so do make sure you have AWD/4WD — our Camry handled it no problem, just be prepared. Convenient home base close to many trailheads. Very cozy for a long weekend.", "rating": 5}, {"review": "What a lovely place! It’s quiet and peaceful. You’re surrounded by nature. We enjoyed our stay.", "rating": 5}, {"review": "This cabin was spectacular, really elevated the experience of being in nature and connected to the outside. Everything in the tiny house was well thought out and had a purpose, it really didn't feel like it was cramped or missing anything at all. We will definitely be back to this cabin later next year!", "rating": 5}, {"review": "Definitely a perfect stay! Looks exactly like the photo and we felt like in a fairytale. I will absolutely stay again if I come here again. The steep road to the little cabin was my only concern reading the listing description but it turned out to be fine…  if you are scared like me, just park the car down the hill. There is only 30 sec walking to the cabin.", "rating": 5}, {"review": "Chalet très bien décoré avec des meubles et matériaux de qualité. De belles aquarelles au mur, de beaux plaids en fourrure tout doux, de petites lanternes décoratives et un équipement complet pour cuisiner et se divertir (tv, lecteur dvd, dvds, jeux de société). <br/>Quelques bémols : <br/>- très peu de luminosité, ce qui fait qu’on a l’impression qu’il fait nuit dès qu’il fait un peu nuageux, <br/>- la machine à laver- sèche linge ne sèche pas le linge qui ressort humide même après un cycle de séchage super long. <br/>On a apprécié la nuit ici, mais on pense que le prix est finalement très élevé pour ce qui est proposé.", "rating": 4}, {"review": "The little house was everything that was described in the listing and so much more! Can’t wait to visit again soon!", "rating": 5}, {"review": "Un superbe séjour dans ce petit chalet en forêt, notre seul regret est de ne pas avoir pu y rester plus longtemps!", "rating": 5}, {"review": "Awesome place for a getaway trip! The surroundings is pretty tranquil yet still close to everything.", "rating": 5}, {"review": "Loved the house and the serenity", "rating": 5}, {"review": "This is a very quiet little house tucked away in the forest. Very clean and had all of the things needed to enjoy a relaxing stay close to Mt Hood", "rating": 5}, {"review": "Was an incredible stay, not SUPER private, but wasn’t expecting it when booking.", "rating": 5}, {"review": "Amazing place, would stay again", "rating": 5}, {"review": "Adorable! Perfect little place for the two of us!", "rating": 5}, {"review": "Beautiful spot. Has a fantasy-like quality about it. Great hiking nearby. Lovely little getaway.", "rating": 5}, {"review": "Amazing place.  Really gorgeous both inside and out.  Wish I could have stayed for much longer.", "rating": 5}, {"review": "This tiny home near Mt. Hood was INCREDIBLE. After a long day of hiking it was so peaceful and private in the middle of woods, and just such a cool place. Very close to hiking trails, restaurants, groceries, coffee, anything we might want/need. Couldn't have asked for a better place", "rating": 5}, {"review": "A gorgeous little cabin in the woods in a perfect location to explore the Mount Hood area. We did the Tamanawas Falls trail and then stopped at Trillium Lake for sunset!<br/>Susan’s tiny home was very cosy and the attention to detail was so lovely. We appreciated the DVDs and games offered. <br/>We also loved having breakfast on the porch in the morning. I would definitely recommend this place!", "rating": 5}, {"review": "My favorite Airbnb ever! So beautiful and well-designed. I loved every second in this adorable cabin space. Wonderful forested area.", "rating": 5}, {"review": "Das Häuschen hat uns sehr gut gefallen und wir würden es auch unseren Freunden empfehlen. Es gab sogar eine Klimaanlage, was bei den aktuellen Temperaturen ein großes Plus ist. Es war schön eine kleine Küche zu haben um sich ein paar Kleinigkeiten zuzubereiten. Besonders schön war das große Fenster direkt neben der Couch mit Blick in den wunderschönen Wald. Auf der kleinen Terrasse lässt es sich auch gemütlich sitzen, vielen Dank Susan!", "rating": 5}, {"review": "Susan’s place is nestled into the side of the mountain and super cozy. The decor is gorgeous and a little luxurious. The design makes you feel like you are immersed in nature. This place is not for someone who might have trouble climbing a ladder to get to the bedroom. The steps are steep and not the easiest to maneuver if you’re not fairly in shape. Other than that, we highly recommend staying here if you have the chance. It’s lovely!", "rating": 5}, {"review": "Beautiful, peaceful, western cabin feel.  Perfect for two.", "rating": 5}, {"review": "Incredible place to stay!", "rating": 5}, {"review": "Cute spot close to a lot of great hiking! Definitely read the hosts instructions on how to find the cabin, google maps is not accurate. It was a PNW cozy cabin surrounded by green forest! Loved!", "rating": 5}, {"review": "This was the airbnb I was most excited to stay in visiting Oregon because the pictures were BEAUTIFUL. The cabin itself perfectly matched the pictures online. However, it was very hard to find and hard to get to. There is also no service in the area if you are using google maps or need help. Once I got to the cabin there is no wifi password listed anywhere. I could not contact Susan to check in or ask for help. I had to walk down the hill to her main cabin and shout until someone could hear me. Susan came out and I explained to her that as a solo woman traveler in the middle of the woods, I would feel more comfortable having wifi so I could make a call incase of emergency. She gave me a wifi password that said connected and lit up with 3 bars but no calls or text worked still. The anxiety this gave me made it extremely hard to enjoy the stay.", "rating": 2}, {"review": "This place was very nice and secluded surrounded by a nice forest and perfect setting to have a small bonfire if you like glamping perfect spot for it. Stargazing was great and the house was super cute and nifty. The beds were comfy! The driveway was steep so make sure to have AWD and follow the hosts instructions on getting their as the GPS takes you to the road below.", "rating": 5}, {"review": "I was absolutely amazed how beautiful this place was. Not only was the inside adorable and so nicely decorated, the beautiful forest the cabin is nestled in just blew us away. I'm so glad we made the trip!", "rating": 5}, {"review": "This little cabin is such a treasure find! It’s tucked away in a quiet forest while being very close to the main hiking trails and attractions around Mt. Hood. Cabin is thoughtfully designed and decorated. Reading a book in the tranquil garden with birds singing around was one of the highlights of my Oregon roadtrip.<br/>Wish we were able to stay for more than one night. Will be back soon!", "rating": 5}, {"review": "It’s a very lovely cabin. Cozy and well decorated.", "rating": 5}, {"review": "This little cabin was the perfect place to rest quietly and get some hiking in. Highly recommend!", "rating": 5}, {"review": "We had a fantastic time during our stay. We came to the Portland area for an orchestra show, but wanted to stay out away from the city, as we are avid outdoor lovers. Susan’s place was an absolutely perfect place to get away and relax and take in the peacefulness of the Oregon outdoors. Fantastic food and kind people all around! We definitely hope to return someday, just to hike all around Mt. Hood and the surrounding areas! ❤️", "rating": 5}, {"review": "Amazing stay, this little cabin is even better in person! Would highly recommend this to anyone looking for an outdoor getaway", "rating": 5}, {"review": "Great spot", "rating": 5}, {"review": "Wonderful little cabin. My husband and I really enjoyed our stay.", "rating": 5}, {"review": "Beautiful little cabin surrounded by lush green forest. Private and peaceful. I would definitely go back again.", "rating": 5}, {"review": "a lovely quaint lil place :) great location!", "rating": 5}, {"review": "We had a fantastic stay. The place is small and cozy, but had everything we needed. Great location, easy access. Would definitely stay again.", "rating": 5}, {"review": "Great stay, thank you!", "rating": 5}, {"review": "This was my dream home and I didn't want to leave. Thank you so much for the amazing stay.<br/>For other travelers - I recommend picking up firewood and food to cook at the little market up the street before you get here - Mt Hood Foods (or bring it from home).", "rating": 5}, {"review": "Awesome tucked away cabin. Super cozy", "rating": 5}, {"review": "We had such an amazing stay here! Such a cozy and beautiful little place, with so much natural light and gorgeous views. All the little details, and decor were perfect as well, you can tell a lot of thought went into this home. We went skiing at mount hood while here, and this was the perfect place to come to and relax after a long day out. We hope to return soon! :)", "rating": 5}, {"review": "This little cabin away from reality was just what we needed to get in nature for our Spring Break! We had such a lovely experience. The windows in the cabin are INCREDIBLE and the location was just what we were looking for! Thanks and hope we can come out again sometime.", "rating": 5}, {"review": "We loved this place. It was so cute and quaint, with everything we needed. Comfy bed, WiFi, perfect fire pit. The hill to get there is quite steep but that was explained in the description so we were prepared! Susan was SO nice and responsive. I would definitely stay here again. I’ve even recommended it to a few of my friend couples. Wonderful getaway from the city for a few days. Thank you Susan!!!!", "rating": 5}, {"review": "Besides the rainy weather, it was a great getaway weekend for my wife’s birthday!", "rating": 5}, {"review": "We had a great time staying here! The cabin is beautiful, and has everything you’d want and more to feel at home.", "rating": 5}, {"review": "Such an amazing little cabin, a wonderful winter get away!", "rating": 5}, {"review": "Beautiful little house with immaculate interior and wonderfully and uniquely decorated.", "rating": 5}, {"review": "Lovely setting. Comfy digs.", "rating": 5}, {"review": "Such a beautiful and peaceful stay! Was so clean, amenities are great, and so cozy to every last detail.", "rating": 5}, {"review": "Our second time staying here and you just can’t beat the space! Quiet, cute and so incredibly peaceful!", "rating": 5}, {"review": "Lovely little cabin in a beautiful forest with private surroundings and yet close enough to the main road to make getting to the mountain to ski in the morning easy.  The house was impeccably decorated and the kitchen was very functional and well stocked with essentials. We have a lovely time and look forward to staying here again!", "rating": 5}, {"review": "10/10 would recommend! So cozy with such amazing and serene views. Definitely be sure to bring a flashlight if you’re arriving after dark! That one was on me tho! Lol this place is one of my favorites I’ve ever stayed 🤗", "rating": 5}, {"review": "Probably my favorite Airbnb stay in my 7 years of using this platform. Susan was very responsive and the cabin well so well configured. Slept like a baby", "rating": 5}, {"review": "We absolutely loved our stay at Susan’s cabin! I’m looking forward to booking another stay soon!", "rating": 5}, {"review": "This was the perfect place to stay as a solo traveler. I was looking for a cozy house with some natural surroundings and this was perfect. Susan was helpful with a couple of things I needed during my stay. I’ll definitely be back!", "rating": 5}, {"review": "Was fantastic to get away from our busy life and have peace and quiet. Susan was super helpful with any questions we had and made the stay that much better.", "rating": 5}, {"review": "We loved our stay at this cabin! Very quiet and peaceful. Was exactly what we needed to enjoy our time at Mt Hood! If visiting during the wetter parts of the year, I recommend bringing fire starter for the wood stove and outdoor fire pit. Would absolutely stay here again!", "rating": 5}, {"review": "This was our second time staying here! The cabin, again, was so inviting and cozy. I’d also like to note that the interior both times has been sparkling clean.", "rating": 5}, {"review": "Me and my wife came here to have a peaceful weekend and this is the place for it. This cabin is very cozy and is up in the hill hidden. Would recommend to anyone that needs a reset or getaway", "rating": 5}, {"review": "A wonderful space to escape to for a few days. The surrounding trees and landscape is absolutely beautiful. This would be a great place to stay and enjoy at any time of the year.", "rating": 5}, {"review": "Cozy, peaceful, and private. I highly recommend booking this place.", "rating": 5}, {"review": "Beautiful place. Peaceful and lovely weekend getaway!", "rating": 5}, {"review": "This place was absolutely adorable and amazing. We stayed only 2 nights of our Oregon trip but wish we could’ve been there the whole time. Susan was super nice and gave us some great recommendations! The place was cozy and surrounded by tons of greenery it made for the perfect rainy day in. 100% will be back.", "rating": 5}, {"review": "I have never been in a more peaceful place! This space was perfect for a weekend getaway with the wood-burning fireplace and comfortable bedroom that overlooked huge windows that made it feel like you were outside. The space felt huge and cozy all at the same time. We can't wait to come visit again.", "rating": 5}, {"review": "This was our second stay and it feels like home away from home. It's the perfect mountain retreat for two people! We will definitely be back again!", "rating": 5}, {"review": "Lovely cabin! Beautifully built and styled. Such a peaceful retreat from the busyness of life.", "rating": 5}, {"review": "We love the place really a gateway with nature contact.<br/>Susan super helpful and friendly everything impeccable and lovely ☺️", "rating": 5}, {"review": "Absolutely amazing! Wish we could of stayed so much longer.. beautiful!", "rating": 5}, {"review": "Nice cabin with nice decorations. Private yet not completely isolated as the nearest neighbor is about 60 feet away.", "rating": 5}, {"review": "So beautiful! Very private, and super cozy and pretty. The driveway is no joke, but was totally manageable in a 4 wheel drive. If you are big and/ or tall some of the tiny home elements might feel a little tight (think RV sized bathroom). Overall a really magical little spot!", "rating": 5}, {"review": "Great place to stay!", "rating": 5}, {"review": "This place was everything we could have asked for. Susan was so kind, and we had a wonderful time. The space was incredibly comfortable and inviting, and close to so many beautiful sights!", "rating": 5}, {"review": "This stay was our 2nd time. We highly recommend this gorgeous little cabin. The exterior is designed perfectly and the interior has a designer's eye - beautiful and welcoming. Wonderful covered porch and large fire pit. <br/>The stairs to the loft are steep, but navigable. Kitchen is outfitted well, but minimal. No oven or microwave. Cooking on fire is where it's at! There is also a grill.<br/>The host, Susan, is super responsive and available. We very much appreciate her!<br/>P.S. If you are lucky, you might meet Big Boss Cat!", "rating": 5}, {"review": "This was our 3rd time back, and certainly not our last. Absolutely beautiful, simple, and well created space. The forest envelopes you and gives you the impression you have the whole mountain to yourself. We love the design that Susan put into all aspects of the cabin. This is the perfect place for a retreat, or in our case, an anniversary celebration. So thankful for our time in this peaceful sanctuary.", "rating": 5}, {"review": "The tiny cabin was a perfect getaway in the woods. Was wonderful for two of us!", "rating": 5}, {"review": "Susan was a great host and very responsive to questions. The cabin feels very isolated and private, but is close enough to the byway to make it super convenient for Mt Hood exploration. <br/>We visited for my husbands birthday and he’s always wanted to enjoy the coziness of a tiny house. This tiny cabin was perfect! <br/>If you’re able to rent/drive an AWD, you’ll be able to drive right up to the cabin. I didn’t see that information at the time of booking so we had to trek up and down the very steep driveway - just take your time and watch your step! Very manageable with multiple trips 😊<br/>Overall great stay, and would recommend.", "rating": 5}, {"review": "We loved our stay at Susan’s place. The cabin was so private and peaceful. Everything was as pictured and close to so many destinations! Would recommend and will book again in the future!", "rating": 5}, {"review": "Very cute cabin. Super clean and quaint. Would definitely stay again.", "rating": 5}, {"review": "If you want a little slice of the wilderness but with the comfort of a little cabin. This is the place for you! Driving up the driveway and seeing the lights on outside was just magical. Bed was extremely comfortable! My Nissan Murano got up the driveway just fine, but it was an AWD. 25 mins to Mt Hood.  Would love to come back here again with a loved one to share this little bit of heaven with.", "rating": 5}, {"review": "Beautiful little cabin-not super toddler-friendly but that’s not anyone’s fault.", "rating": 5}, {"review": "A beautiful space in a beautiful place.", "rating": 5}, {"review": "The place was just as described in the listing. The location was stunningly beautiful. I'd say it's great for couples planning to spend a night or two off the grid (there's low reception in the area and no wifi), which can be very peaceful. Overall, good value for the price.", "rating": 5}, {"review": "We really enjoy our time here! Very well situated to go for hikes all around. Very cosy and intimate inside the cabin, but a little noisy from the highway outside.", "rating": 4}, {"review": "Just love this spot! Great proximity to a lot of trails and a peaceful and private little cabin.", "rating": 5}, {"review": "Beautiful cabin, had a lovely stay. Main cabin was near by so not entirely private but still pretty secluded. I would definitely stay there again. Driveway is extremely steep so heed the owners warning. There is no wifi or cell service (this is listed) which I knew going in but it does make trying to map out hikes etc slightly more difficult. The scenery is worth the stay and the location is very nice (not too far of a drive from some really cool hikes, trillium lake, and Mt.Hood). Also there is a stove top but no microwave (this is listed as well). A microwave would be a nice improvement, but overall the stove top worked fine. I would recommend staying here if you get the chance.", "rating": 4}, {"review": "The cabin was amazing! So relaxing, peaceful, and comfy! And the surroundings are breathtaking! We had the best time! Love that it feels like you’re away from it all, yet everything is a short drive away! Would recommend this place a million times!", "rating": 5}, {"review": "This was a great spot for our adventures in the area. The cabin is just like the pictures and has such a homey charming feel. Everything was clean and Susan was very responsive to any needs that came up. Do heed the description about the driveway. It is very steep. Would highly recommend this place.", "rating": 5}, {"review": "Such a beautiful gem of a cabin. The perfect place for a meteor shower! Be prepared to hoof it up a small hill if you have 2W drive. Luckily we packed relatively light, but definitely plan to take our 4WD next time! Either way, totally worth it!", "rating": 5}, {"review": "This cabin is just gorgeous. It is a quiet and beautiful spot in the woods. Exactly what we wanted as far as surroundings. The cabin has air conditioning, important in our new era of climate change. Stay here if you are looking for some peace and quiet. Bring a book, your coffee/wine and just chill.", "rating": 4}, {"review": "Perfect stay! So cozy, romantic, clean, and peaceful.", "rating": 5}, {"review": "Wonderful 360 views of the lush green trees from inside the cabin! This place is perfect for a romantic getaway.", "rating": 5}, {"review": "Great getaway and quiet. Such beautiful surrounds and views. Highly recommend.", "rating": 5}, {"review": "Wow! I’ve stayed in several tiny homes around the country, and this was by far the best. The space was cozy and extremely clean. The lush green outside of every window made the space feel rustic, while the inside had all the necessary creature comforts including a perfectly nice full bathroom with plenty of warm water for all 3 of us to shower back to back. We spent a bit of time enjoying the lovely outdoor space, which is decorated with various string lights. Would love to visit again when Mt. Hood National Forest doesn’t have a fire ban as it seems like such a cozy place to sit outside by the fire and look up at the stars.", "rating": 5}, {"review": "Mágico lugar.", "rating": 5}, {"review": "Very beatiful, tiny house in the middle of trees. Was so lovely, we really enjoyed our stay!", "rating": 5}, {"review": "Enjoyed the cabin and local trails. Cozy and peaceful!", "rating": 5}, {"review": "beautiful space, perfect for unwinding. you feel secluded despite being close to neighbors (this was a good thing for me, as I traveled alone). very thoughtfully decorated and felt spacious even though it's a small home. super clean and I appreciated the DVD selection and board games", "rating": 5}, {"review": "I absolutely loved Susan’s little cabin. I did a solo getaway to recharge for a day and it was perfect. The beautiful living room window along with the hammock in the woods were the perfect reading places. I would definitely stay again!! Thank you for the hospitality and lovely place.", "rating": 5}, {"review": "Amazing stay for our honeymoon, just as pictured ♥️", "rating": 5}, {"review": "Beautiful little cabin in a peaceful and relaxing location. Wonderful outdoor seating area surrounded by trees/nice landscaping. Very clean/comfortable and had everything we needed. Just wish we could have stayed longer!", "rating": 5}, {"review": "Beautiful places a couple of spiders here and there and a big spider web in the corner of the bed but yeah it was good", "rating": 4}, {"review": "I decided on this vacation destination 100% because of seeing this place. My vacation timeline was determined by this place’s availability. Getting to it, requires 4WD. But the Subaru (AWD) with  x-Mode on made the steep gravel climb look easy up and down.  But that was a part of this place’s appeal. I hope for the chance to stay here again.. and for longer!! It is adorable, quaint, and gave the feeling of being in the middle of nowhere but with being around stuff! Best of both worlds!! I hope to come back soooon!", "rating": 5}, {"review": "We cannot wait to return! This was the most peace that we have ever felt! The perfect getaway from stressful jobs and life.", "rating": 5}, {"review": "The cabin was a perfect hub for days full of hiking and exploring the Mount Hood area!", "rating": 4}, {"review": "This was my second time staying here, because we loved it so much the first time! It’s a great cozy getaway away from the world, but close enough to do things like hiking or getting dinner. Such a gorgeous place; nothing beats waking up in the mountains (especially with the home’s huge windows!). I’d recommend this place to anyone looking for something simple and quaint.", "rating": 5}, {"review": "A truly restful beautiful stay", "rating": 5}, {"review": "Very peaceful and serene. Great place to visit to de-stress and unwind without all of life's distractions. The cabin was clean and cozy. The location was a great place to go on a hike or a drive during the day, and return to the cabin to read or watch movies. Wonderful experience and we will be back again!", "rating": 5}, {"review": "We had a fantastic stay! Very peaceful and great details throughout the cabin!", "rating": 5}, {"review": "Such a beautiful stay and I will definitely be back!", "rating": 5}, {"review": "Beautiful place perfect for a little getaway.  Close to lots of beautiful hikes. Host was very responsive and has the cutest dog :)", "rating": 5}, {"review": "Adorable cabin with great windows to appreciate the surroundings!  The ladder to the bedroom was pretty steep as was the gravel driveway.  There was an alternative parking space on the road as well as a sled to drag our things up the steep driveway.  I just didn't see a photo of the driveway before booking, probably wouldn't have been such an issue if I wasn't 7 months pregnant.  :)", "rating": 5}, {"review": "Located in a beautiful neighborhood! we had a peaceful time surrounded by nature", "rating": 4}, {"review": "A very cozy cabin with great views of nature and just the right amount of seclusion. The decor was very tasteful and fit the mood perfectly. Other than the steep driveway and lack of Wi-Fi (both described that way in the posting), everything was great. We would love to stay again if we are ever back in the area.", "rating": 5}, {"review": "Felt like a fairytale. The area was beautiful with tons to do but the highlight of our trip was definitely the cabin!", "rating": 5}, {"review": "It was a beautiful cozy place! We didn’t want to leave!", "rating": 5}, {"review": "Really charming and well designed space. It felt like we were deep in the woods even though we were only a few minutes drive from groceries and trail heads. Awesome star gazing around the fire. The fresh cut flowers on the deck were a really sweet touch.", "rating": 5}, {"review": "This was one of the best airbnbs we have stayed at! It was adorable and super clean, lots of care taken. Only complaint is that I wish there were a microwave but that’s not a necessity! Would definitely stay here again.", "rating": 5}, {"review": "This place exceeded my expectations immediately. It’s a sweet, cozy little place and the space is really maximized. The walk up to it was quite steep (I have a 2WD) but she sets that expectation! It’s super clean and everything is comfortable. Overall a fantastic stay and will come back!", "rating": 5}, {"review": "Perfect minimalist intimate getaway tiny house in the heart of Mt. Hood National Forest. A rustic romantic ambience.", "rating": 5}, {"review": "Such a sweet place to getaway for a weekend! Loved the fact that there was no service and the peace and quiet of the location was wonderful! Really wasn’t kidding with the 4 wheel-drive. Driveway was really steep. Loved it so much, thank you!", "rating": 5}, {"review": "Beautiful cabin, wish it had wifi but it helped me stay off my phone! The big open windows where amazing! Fire place out side was a vibe! Highly recommend to get away for a nice relaxed trip!", "rating": 5}, {"review": "WOW this cabin is beautiful and has everything you could possibly need! If you’re looking for an escape, this is it! Cannot say enough positive things. Can’t wait to come back!", "rating": 5}, {"review": "Beautiful tiny home (that felt large!) with a gorgeous full wall window. It felt like we were in the forest by ourselves and yet there were neighbors down the road. Beautiful stay with clean spot and had everything we needed!", "rating": 5}, {"review": "Susan was the absolute best host. Recommended a few hikes in the area and was fast at responding. This cabin is perfect and I would recommend this to anyone wanting a getaway", "rating": 5}, {"review": "This adorable little cabin nestled in the woods is such a magical stay! I absolutely loved the large window in the sitting area and everything about this spot was so aesthetically pleasing! It held such a romantic, cozy and at-home feeling :) I will absolutely be visiting again someday!! <3", "rating": 5}, {"review": "We were so looking forward to staying at Susan’s place but unfortunately we were unable to last minute due to a town water main break that was out of Susan’s control and caused her place to not have water. Susan was so gracious to call us proactively and let us know about the issue and work to find us a solution. We were very appreciative of her communication and helpfulness and will definitely try to stay here in the future if we are in the area again!", "rating": 5}, {"review": "It was a very cute little cabin. It was decorated very well and was so cozy. I found everything I needed except coffee filters but no biggie cause I brought my own. There was a huge spider inside but that’s no surprise since it’s in the woods. I caught it and that also wasn’t a big deal. I found the steep driveway very slippery to walk down and I almost wiped out on the snow a few times, but overall the visit was lovely and I’d like to visit again in the summertime when I could spend more time outside and enjoy the cute yard. Thanks Susan!", "rating": 5}, {"review": "We had a lovely time relaxing at Susan’s beautiful little cabin. It was so cozy and warm. We would love to come back one day!", "rating": 5}, {"review": "Lovely little cabin in the woods. We experienced a snowy weekend (~12 in fresh snow) and this was a perfect cozy place to take it all in. Very well executed space, new and clean. We will definitely return.", "rating": 5}, {"review": "Thank you for giving my boyfriend and I the best vacation stay we've ever had thus far! Amazing Amazing place!!! perfect prize, gorgeous, like a dream. unreal", "rating": 5}, {"review": "This cozy little cabin is the perfect getaway. The cabin is tucked in the hills, it’s very quiet and private. Susan has thought of pretty much everything. It’s super cozy, they have lots of blankets. <br/>Three things:<br/>1) there is no cell service in the cabin (nor any wifi, as listed.) This was ideal for us, as we just spent the entire week end reading, but it’s good to know. <br/>2) when Susan says you need 4WD or AWD, please believe her. We had a 4WD truck, but couldn’t make it up the driveway in the snow because we didn’t have snow tires. We had to walk up and down the driveway, which wasn’t a problem. Just make sure you bring good shoes.<br/>3) For two people, showers were capped at 10 minutes each. After that, the hot water starts running out.  <br/>All in all, we had a lovely stay, and I highly recommend this comfy little cabin for unplugging from the hustle and bustle of every day life.", "rating": 5}, {"review": "Loved the place, loved how private it was. We were there when there was lots of snow so sadly we weren’t able to drive all the way to the top where the cabin is. They had a sled to take our stuff up so that was great. Everything about this place was AMAZING, would come again for sure ! Thank you !", "rating": 5}, {"review": "This little loft was the perfect spot, from the snow to the local scenery…. Everything was beautiful and a great time", "rating": 5}, {"review": "Thank you glad we stayed with you", "rating": 5}, {"review": "Better than we could have imagined! Will be recommending to everyone I know, and can’t wait to come back for another stay soon!", "rating": 5}, {"review": "We really enjoyed this cozy stay!", "rating": 5}, {"review": "Beautiful,serene peaceful place.We loved it.", "rating": 5}, {"review": "The house was just as squeal-inspiringly cute and cozily-private-feeling as it looked in the photos. The kitchen, though small and simple, was totally workable without useless excess; we very much appreciate the thought that has obviously gone into the design and outfitting of the space. Lots of walking opportunities nearby, and with a wood stove waiting, we weren’t worried about getting wet.<br/>Dragging the (provided) sled with our stuff up the driveway to get there (the van we came in is 2WD) was a fun event for us; I might caution future visitors to be realistic about the weight of your load when you do it and consider two trips!<br/>Started thinking about when we could come back on our first morning, sipping coffee on the porch.", "rating": 5}, {"review": "Lovely cozy cabin in the woods.", "rating": 5}, {"review": "The perfect quintessential mountain cabin. It had almost everything we needed, and the things it didn't, we were able to get at the local store. It was clean, quiet, private, comfortable and PERFECT for a relaxing getaway. The bed was very comfortable and a great nights sleep. We will definitely be back! 💗", "rating": 5}, {"review": "Great little place! Enjoyed movie nights! Thank you for allowing us to stay!", "rating": 5}, {"review": "We had an incredible time staying here! Beautiful cabin tucked in the trees that allows you to just disconnect and relax. Wasn’t to far away from restaurants, and shops, and only about a 15-20 minute drive to Government camp. Very cozy place that I would highly recommend for anyone looking to just get a way for a bit.", "rating": 5}, {"review": "Very nice place! There is another cabin nearby, but beautiful place regardless.", "rating": 5}, {"review": "We stayed in Susan’s Little House on the Mountain for only one night… a mid-week get away. We loved the craftsmanship and decor, and it was plenty spacious for the two of us. The heater kept the house nice and warm, and we did attempt a fire in the little wood stove…. we couldn’t keep it going, but loved trying. Such a beautiful little cabin in the woods that we would love to come back to.", "rating": 5}, {"review": "Really convenient location for skiing at Mt. Hood Meadows. Clean and great ambience. Would gladly stay again.", "rating": 4}, {"review": "Amazing little cabin tucked in the woods! We used this as our base camp when visiting Mt Hood Meadows. We loved coming back to the cozy fire and enjoyed sitting on the front porch! Susan was a great host, extremely responsive and gave us helpful tips when needed! Definitely recommend!!", "rating": 5}, {"review": "Great place for a stay on the mountain!", "rating": 5}, {"review": "Lovely little cabin set in the woods. One important note, if you have a mold sensitivity I don’t recommend staying here. It has a distinct mold smell - not uncommon for the area (it is functionally in a rainforest) but it was bad enough to cause headaches for those with a sensitivity. Otherwise, this was a great spot. Very clean and cozy. The wood stove created a great atmosphere.", "rating": 4}, {"review": "One of our favorites:) Has everything you need and is in a great location!", "rating": 5}, {"review": "Cute & romantic tiny home.", "rating": 5}, {"review": "This was such a gorgeous home! It was so nice to just get away for a weekend. The place is incredibly cozy, and we were lucky to have snow while we were there! Susan was really nice, offered help with my vehicle, and gave clear instructions for parking and check-in. I would love to come back in the summer!", "rating": 5}, {"review": "Great place will definitely be coming back!", "rating": 5}, {"review": "We loved our stay! Everything was so pristine and aesthetically pleasing. Loved the little fireplace inside. Beautiful property and a very communicative host.", "rating": 5}, {"review": "Had a very sweet few days in Susan’s cabin! Lots of boardgames, good meals and sitting by the fire!", "rating": 5}, {"review": "very beautiful little cabin! right across the street from the turn off to Ramona falls, the interior design is gorgeous & we absolutely enjoyed our stay. I will be recommending to friends and family and hope to visit again 🥰", "rating": 5}, {"review": "What a beautiful cabin in the woods! Exactly as pictured, the bed is super comfortable, the place is so cozy and quaint, and such a beautiful location! I wish I stayed longer! Recommend 4wd for getting up the place but it’s only a short walk to the cabin if you can’t get 4wd!", "rating": 5}, {"review": "We enjoyed this enchanting stay! The cabin is adorable and nestled in the woods in the cutest way. The place is decorated in the cutest woodsy theme. I will be coming back.", "rating": 5}, {"review": "Susan's place was an absolute dream. My husband and I have 3 young children and needed some time alone desperately. We stumbled upon this tiny cabin that was clean and heated and just as described. We went into town one time to eat and spent the rest of the time in our fuzzy robes falling inlove all over again. Susan offered more firewood and was extremely friendly and willing to go out of her way to meet our needs. We will definitely be returning!", "rating": 5}, {"review": "This is a lovely cabin in a beautiful area, perfect for hiking Mt Hood and its environs. We enjoyed the quiet and  Susan was very helpful in answering questions.", "rating": 4}, {"review": "This was such a cute little cabin with the most relaxing view. Absolutely loved our stay!", "rating": 5}, {"review": "Such a great spot to get away! I wish I could have stayed longer!", "rating": 5}, {"review": "Susan's place felt delightfully remote. Cute as can be, and everything we needed for a close to our Portland home escape. So glad she shares it!", "rating": 5}, {"review": "Beautiful, simple, peaceful, this space has everything you need and nothing you don’t.m. If you want a space to truly get away, behold! you have found it. We really enjoyed our time here. Not our first visit, and certainly not our last.", "rating": 5}, {"review": "One of my favorite Airbnb’s to date. Secluded little cabin in the woods. Fantastic atmosphere. Highly recommend.", "rating": 5}, {"review": "This stay is great if you're looking for a dose of solitude. I had a Toyota 4 Runner, dropped down into Low 4WD and still spun a bit trying to get up to the cabin because it was raining. That had me worried that I may be charged a silly $20 gravel fee. I wasn't about to walk up that hill after climbing Mt St Helens, my legs were gone. So the host isn't lying when they say you need a 4WD. If you're not an idiot though, its manageable.<br/>Other than that, my stay went fine. You can expect to have zero cell coverage in Rhododendron, and I feel like this stay should've been in the $150 range instead of $230, just on lack of amenities. No wifi, TV has DVD player only, Fire pit was unavailable. Throw a hot tub on the front porch and maybe the rental cost would be justified. Also, I dont remember seeing it mentioned in the listing that the host lives a stone's throw away, although this wasn't an issue. <br/>Beautiful area though, and make sure you check out Al forno Pizza just down the road!", "rating": 4}, {"review": "I really enjoyed my stay at this little cabin/home. Everything was clean, tidy and super cozy! So fun!", "rating": 5}, {"review": "What a peaceful getaway in the woods. I booked this place as a surprise gift for my wife for a night away from our young children to rest and relax. She had nothing but positive things to say. Highly recommend!", "rating": 5}, {"review": "Hopefully you have a 4 x 4 to get up to the driveway.  If you don’t  they’ve got this sled  to pull things up. You  get a little exercise in before you chill out at really cozy,  cute and well-kept cabin. Highly recommended❤️", "rating": 5}, {"review": "Beautiful cabin!!!! We will be back for sure!", "rating": 5}, {"review": "Awesome tiny house on the side of a mountain. Everything was as described. It was a great getaway for the wife and I.", "rating": 5}, {"review": "What an amazing little cabin. Perfect for two people. Very clean and all the little touches in the decorating were adorable. We didn’t get to enjoy the fire pit area because there was a burn ban in effect, but it looked like a great set up. <br/>We really enjoyed our stay", "rating": 5}, {"review": "This cabin was the perfect getaway for us. It feels very secluded and yet it’s not far from cute restaurants and bars! We spent a night here during our road-trip honeymoon and it was everything we could’ve hoped for!", "rating": 5}, {"review": "This has truly been the coziest places we’ve ever stayed. The location is INCREDIBLE! The cabin is very private and surrounded by a thick Jurassic park-like forest. It is honestly like entering a whole different world. The loft is very cute and the kitchen is great! Be sure to bring your own spices if you plan on cooking! *Salt and pepper are supplied (:", "rating": 5}, {"review": "Loved it! Secluded but not remote. Stunningly beautiful, quiet except for a little traffic noise from Hwy 26. All amenities we needed. Bed is very comfortable. Pix are very accurate. <br/>*Bring your own TP.", "rating": 5}, {"review": "Even cuter than the pictures! And Susan was a 10/10 host. We will be coming back.", "rating": 5}, {"review": "We had a wonderful one night stay at this cozy cabin. It was such a beautiful space inside and out, secluded and surrounded by trees was just what we wanted. Susan’s cabin was super clean and had all appropriate amenities. Despite not having 4WD we found it pretty easy to locate and get up to the cabin. It’s located nearby some delicious restaurants, which is a plus.<br/>Would definitely recommend :)", "rating": 5}, {"review": "Amazing location and the coziest place we could have wanted.", "rating": 5}, {"review": "This was my third visit to this sweet little cabin and it has been so pleasant each time! Lovely, tucked away location! Love the outdoor fire pit, proximity to lovely walks / hikes, functional little kitchen, and a DVD player (so fun!) for those relaxing indoor vibe moments! A local gem!", "rating": 5}, {"review": "This cabin was the highlight of our trip! We were worried it would be a little small, but the pictures are deceiving and it is SO spacious! Plenty of room and the huge windows made it seem so much bigger. The highlight was having meals outside by the fire pit and looking at the trees/stars! Perfect little getaway spot with everything you could possibly need!", "rating": 5}, {"review": "A great getaway in a beautiful place", "rating": 5}, {"review": "Beautiful little house in the woods... Very private, quiet, and nice! We had a wonderful stay!", "rating": 5}, {"review": "Very cozy and comfortable", "rating": 5}, {"review": "The cottage is as described and pictured in the photos.  Beautiful location, comfy bed and good shower, nice outdoor space, including fire pit.  Susan was easy to reach and responsive to our particular needs.  Definitely recommend and would stay again.  Do pay attention to the description of the drive way - it is steep and a bit of a walk from the road (assuming you do not have 4wheel drive). Thanks Susan!", "rating": 5}, {"review": "We had a wonderful stay at Susan's cabin.  We loved the outdoor firepit setup and found everything to be very clean and functional.  It is a great location for exploring the Mt hood area & hiking.  We hope to come back sometime soon", "rating": 5}, {"review": "Great little getaway!", "rating": 5}, {"review": "This cozy cabin was a perfect stopping point on our trip to rest and enjoy the scenery. <br/>With no internet or cell service, we took it easy and enjoyed the wood burning stove and board games. The comfortable couch was a great spot to enjoy the view out of the massive living room window.", "rating": 4}, {"review": "You will never want to leave!  This space is beautiful inside and out. It was thoughtfully designed to accommodate all your needs. The lack of connectivity to Internet is heavenly.  A short drive up 26 you’ll find the best BBQ and cocktails at Skyway.  It is quite a steep driveway to walk up to the cabin, since we don’t have 4WD but 100% worth the effort!!!", "rating": 5}, {"review": "Beautiful cabin in a beautiful part of Oregon. Definitely recommend!", "rating": 5}, {"review": "This was such a perfect find for us! The cabin was nice and secluded and had such a great view. If it matters to you, there’s no Wi-Fi or really any service at the cabin, but it just lets you enjoy it even more. The town itself is cute and we enjoyed going to Fernies for coffee in the morning.", "rating": 5}, {"review": "Simple, yet amazing.", "rating": 5}, {"review": "Looking for a cabin getaway tucked away in the mountains close to everything you need, this is the place! Me and my wife truly enjoyed the beautifully crafted space while we are there. Perfect for disconnection to the world to be better connected with nature. We spent our time reading by the wood burning stove and just enjoying time together. Would highly recommend!", "rating": 5}, {"review": "Cute cabin, enjoyed my stay!", "rating": 5}, {"review": "The cabin was charming and peaceful and beautifully kept.  I stayed for four nights and loved every minute of my stay there!", "rating": 5}, {"review": "I will totally be back! <br/>There was next to no cell service (for verizon anyway)- which to me was a MAJOR plus given that I was seeking a retreat, and something that would draw me back as a way to disconnect and unplug.<br/>There was a little bit of road noise from the main road down below, so if you're looking for a ~totally~ quiet woodland experience, this is maybe not the spot for you. But it was perfectly secluded- I could see one neighbor's house from out front but not at all in an intrusive way. And while being so perfectly secluded, it is still 5 minutes away from a well stocked grocery store that sells firewood, and a cute lil Japanese restaurant down the road (koya kitchen!). <br/>I loved this beautiful cabin and the upstairs loft specifically was so cozy and delightful that I found myself missing it when I got home. There is a DVD player with maybe 10 films, so bring a movie!", "rating": 5}, {"review": "What an amazing place! We will be coming back!", "rating": 5}, {"review": "Very cozy cabin! A little hard to find at first (thanks to Google, Susan's directions were great), but well worth it in the end. A quiet little neighborhood that was close to Mt. Hood and only a short drive from Portland. Excellent location and the cabin itself was comfortable for the two nights we stayed. Highly recommend!", "rating": 5}, {"review": "No cell data reception for certain carriers. Bring books. It’s actually nice to get away from your phone screen ;)", "rating": 4}, {"review": "This tiny home/cabin had great views! The pictures didn’t do much justice … it was much more alive in real life ! Very cozy and private for a relaxing getaway. Adina and I would recommend this cabin and would definitely come again ! - Will & Adina - FL", "rating": 5}, {"review": "Beautiful place to relax, unplug and get away from the busy of life!", "rating": 5}, {"review": "We had a great, snowy weekend and loved the cabin! It was a great place to enjoy some outdoor activities on Mt. Hood.", "rating": 5}, {"review": "This is such a lovely place to retreat to!!", "rating": 5}, {"review": "We had a great stay!", "rating": 5}, {"review": "This Cabin get away is wonderful and enchanting. It feels nice and private, good to relax and unwind from the business. Also very convenient to reach hikes and all the fun things Mount Hood has to offer.", "rating": 5}, {"review": "Susan’s cabin is a great place to stay and we will definitely be back! The location is wonderful and we had a great time exploring everything Oregon has to offer. Definitely go to the Skyway Bar and Grill down the street, they have great mac and cheese.", "rating": 5}, {"review": "One of the cuter AirBnBs I’ve stayed at. <br/>A beautiful secluded tiny home decorated like a cabin (and decorated very well!). Close to Mt Hood skiing and trailheads. Gravel road on the way up was potholey after some heavy rains but nothing even a little sedan couldn’t handle.<br/>Huge windows (with blinds for privacy) and a lovely little wood burning stove = one incredibly relaxing vacation.", "rating": 5}, {"review": "What a beautiful little cabin! We had everything we needed inside and out! The views are breathtaking! Relaxation at its finest!", "rating": 5}, {"review": "A delightful, tastefully decorated cabin - our night here was so cozy and restful. Just what we needed for a recharge away from the city lights! :)", "rating": 5}, {"review": "Great place, warm, cozy and quiet. They’ve packed a lot into this little space. The setting is lovely and feels remote while actually being fairly close to a couple restaurants and the grocery store. Really appreciated that. <br/>And Susan was very helpful and responsive to our questions. That’s always reassuring.", "rating": 5}, {"review": "What a great little cabin! Very clean with all the amenities. Great natural light, very private, and quiet. Looking forward to a return visit", "rating": 5}, {"review": "Charming cabin. Well designed. Connected to nature and conveniently located to restaurants and Mt recreation.", "rating": 5}, {"review": "This place is awesome, perfect for a couple wanting to disconnect from the world and spend quality time together. Thank you also to the wonderful host Susan. We will be back :)", "rating": 5}, {"review": "The coziest little cabin tucked away off the highway. We can’t say enough amazing things about our stay here and hope to be back for more weekends away from the city.", "rating": 5}, {"review": "loved the stay :) it's a perfect romantic getaway in the woods, where you want to wind out and spend quality time!", "rating": 5}, {"review": "Gorgeous, private, deep in the woods—an ideal and special place.", "rating": 5}, {"review": "This little cabin is so quaint and was the perfect little adventure get-away for our first wedding anniversary.", "rating": 5}, {"review": "What a fabulous stay! We came to celebrate our 28th wedding anniversary. For years I wanted to stay at a cabin in the woods, so when my husband found this little gem I was delighted! We enjoyed our morning coffee by the fire,  afternoon walks around the area and movies in the evening. It’s such a cozy little place and everything I could’ve hoped for. I would definitely like to come back during different seasons. thank you so much for providing such a relaxing, peaceful getaway for people to enjoy, we would definitely recommend", "rating": 5}, {"review": "Beautiful location. amazing communication and accommodation from the host. I WILL be returning for more", "rating": 5}, {"review": "This was such a dreamy experience! A beautiful place enveloped in an even more beautiful surrounding. Thank you so much for cultivating an environment that provided some much needed r & r. <br/>Cleanliness, communication, and everything else was top notch. Can’t wait to visit again 🌌", "rating": 5}, {"review": "A wonderful weekend getaway without having to drive too far into the mountain. I was a little worried when I saw that this was off US-26, but it's completely tucked back in the hillside, so we heard no traffic whatsoever—just birdsongs! (A note on the location: Google Map's live directions couldn't read exactly which road we were on and misled us, so make sure to look at the map as well as the directions. Accidentally drove up someone else's driveway!)<br/>The cabin was cozy. Susan's description of the place and amenities was accurate as well. Not pictured in her photos is a little wood-burning stove, which we used every evening (not necessarily because we needed to—the place had an excellent heater). There are some board games as well! We went on a little hike along Salmon River, then got lunch at Koya Kitchen (delicious soup and sushi!).", "rating": 5}, {"review": "It was a nice stay. Do recommend arriving before sunset to the airbnb. It was enjoyable my friend and I had s’mores. It was a nice little cozy place.", "rating": 5}, {"review": "My boyfriend and I stayed in this cozy cottage for a yearly snow shoe trip. This little cabin was the perfect place to unwind after long days in the snow. The cabin was clean, remote and has everything you need for a weekend away. We had fires every night and really enjoyed just reading, eating and playing games. We definitely would love to stay here again.", "rating": 5}, {"review": "This was such an amazing and cozy little cabin. My fiance and I book this cabin for our snowboarding trip at Mt Hood Meadow. this place was definitely a gem. Will definitely book again in the future.", "rating": 5}, {"review": "This cabin is amazing! My fiancé and I stayed for New Years and it was a dream! We love the space provided, especially the loft area where you can wind down and watch some movies. The fire stove was a great addition, really warming up the place and making it feel homey. We definitely plan to come back!", "rating": 5}, {"review": "Loved Susan’s beautiful cabin so much! We enjoyed quality time together as a family doing chess and board game together in the night and woke up with beautiful snow scenery from the window! We made lots of memory with this tiny beautiful cabin! Thank you so much!!", "rating": 5}, {"review": "Absolutely beautiful. It was a perfect little spot to get away for the night. We watched the snow fall from the big picture window, cozied up under the heavy blankets. We would definitely go again, and highly recommend.", "rating": 5}, {"review": "This cabin was a wonderful winter getaway. If you go in the winter, you will need AWD to get up the to parking spot at the bottom of the driveway. <br/>We loved the majestical feeling of being surrounded by the snow in this cozy cabin, with a nice fire! <br/>Bring your own wood/kindling and easy to prepare food because the pans can be sticky, even with oil. We are excited to come back in the spring or summer!", "rating": 5}, {"review": "It’s a lovely spot!", "rating": 5}, {"review": "Great little quiet place to relax and have a weekend full of adventure", "rating": 5}, {"review": "I loved that the pictures really showed the house it was easy to find and a great place to relax.", "rating": 5}, {"review": "Loved every second of our 3 night stay. Sipping coffee on the porch, making dinners, exploring the woods out back… rained and snowed, yet the cabin stays warm. The driveway is STEEP so be prepared — but no problem with 4x4 even with a snow dusting!", "rating": 5}, {"review": "When you pull onto the road from the main highway, take the first left. Google maps led us straight and to a different house :)", "rating": 5}, {"review": "My girlfriend and I spent thanksgiving weekend here and it couldn’t have been a better place to stay. We had outdoor bonfires as well as a couple indoor fires. We loved watching movies in bed at night and waking up and having coffee on the porch. So many cool hikes, restaurants and coffee shops so close by as well as being less then an 1 hour from Hood River and 30 minutes to Sandy. 100% would stay again.", "rating": 5}, {"review": "Cute, cozy, and secluded space! Easy check-in. Definitely need 4x4. A little tricky to turn a pickup around. Stopped by the grocery store for some breakfast groceries and snacks! Also took my firestick and used my hotspot for internet! A few restaurants bout 1-2miles from the cabin. It was a nice getaway wkend:)!", "rating": 5}, {"review": "This place is cute, cozy, and has a great location for beautiful local hikes. For anyone worried about going up there in the colder months, do not worry about being cold because the heater/AC unit is amazing. We came back from a cold and wet hike and got warmed up in no time thanks to that heater. Lastly, the small and cozy restaurants/cafes in the area have amazing food and atmospheres! Would definitely like to be back in the future!", "rating": 5}, {"review": "A thoughtful, simple, beautiful get away space. Every detail is thought out and taken care of, right down to the design of the space. Just what one needs to be still and relax and recenter. I can not recommend this enough for a quiet retreat(though I’d be hesitant to for fear of not being able to book it again myself :) )", "rating": 5}, {"review": "Such a beautiful tiny home in the woods!  My husband and I really enjoyed our stay, the location was perfect and the house was so cozy!  Recommend highly!", "rating": 5}, {"review": "This place was stunning- I wish we could have stayed for more than one night.  The surroundings were magical, and the space itself was beautifully decorated and super cozy.  We got to build a fire and enjoy the peace and quiet.  Host was quick and responsive, and gave us local recommendations.  I would love to come here again, thanks so much for the stay!", "rating": 5}, {"review": "Wow! This place was even better than imagined, the pictures can not capture the magic of this cozy little cabin. Everything about it was absolutely perfect and we look forward to coming back every chance we get!", "rating": 5}, {"review": "Cozy, peaceful, restful", "rating": 5}, {"review": "A comfy cozy beautiful mountain forest getaway.", "rating": 5}, {"review": "Such a beautiful and secluded little cabin! I had so much fun enjoying a night to myself. I spent HOURS wandering around behind the cabin foraging for mushrooms and enjoying the sounds of the forest. The hill to get up to the cabin is definitely steep so the 4WD is 100% necessary. But if you don’t have that, there’s parking at the bottom and you can walk up (it’s a very short distance). The stairs to the loft are also very steep (more of a ladder) so if you’re uncomfortable with your balance and coordination, the couch downstairs is quite comfy and has a fur blanket! I loved it and will definitely be back.", "rating": 5}, {"review": "This cabin is perfect to just away from it all. Super cozy and, when the weather is rainy, the atmosphere is amazing. Highly recommend for anyone wanting to relax from the hustle and bustle of life 🤗", "rating": 4}, {"review": "I booked this place for a birthday trip, and it was perfect. <br/>The vibrance and lushness of the surrounding nature, the sound of rain on the metal roof, and the cozy design made this a perfect destination for fall in Oregon. <br/>It is was a great distance from a variety of grocery stores, hikes, and activities, and the cabin boasts a very functional design. <br/>When we weren't out and about, the cabin was perfect for getting warm, napping, reading, watching movies, playing games, and cooking. <br/>I highly recommend this stay.", "rating": 5}, {"review": "Beautiful, charming cabin right up in the forest. Exquisitely decorated, charming and a lovely place to stay for exploring the area.", "rating": 5}, {"review": "We were there for 3 days and nights and it rained almost the entire time... our stay was FANTASTIC! The front porch was covered and a great place to sit and watch the rain fall in the woods. The best part was falling asleep hearing the rain on the metal roof. We did manage to have a couple of fires in the awesome firepit and even managed dinner on it once. What a lovely little cabin in a private woodsy setting! Susan is a great host and decorated the cabin perfectly. Already planning our next visit and how to make it a biannual event! (Truths: 4x4 needed, ladder to loft, you got this... if you're lucky you might get a visit from Big Boss Cat/Kitty.)", "rating": 5}, {"review": "Absolutely incredible place, seriously. The photos don't do this little place justice. It sits atop a steep climb behind the owners property, entirely private with great views of the forest around it, and the hillside across the valley. A 15 minute drives gets you to the base of Mount Hood with several options for hiking and sightseeing. The food options around are fantastic and the grocery store down the road is incredibly well stocked for a mountain town. We will definitely be back!", "rating": 5}, {"review": "This cabin is exactly what you see in the photos but even better! Perfect for a two person getaway. Well organized and very clean. Great location for restaurants and hiking/lake activities near MT Hood. We will be back!", "rating": 5}, {"review": "Cozy little getaway cabin. Beautiful setting. Everything you need for a fun weekend away.", "rating": 5}, {"review": "This little spot is the PERFECT getaway and break from the throws of every day life. The design of the landscape and cabin is impeccable. It’s pretty close to a lot of restaurants, only 30 mins to Trillium Lake and 1 hour (gorgeous) drive down to Hood River to check out a ton of amazing wineries.", "rating": 5}, {"review": "Wish I had more time for my stay! Loved this place would highly recommend!", "rating": 5}, {"review": "Great Stay! Highly recommend", "rating": 5}, {"review": "Such a beautiful and peaceful little cabin. We enjoyed our stay!", "rating": 5}, {"review": "The Little House on the Mountain is a perfect stay for a quiet, romantic and secluded getaway. Susan is an amazing host and has everything ready and waiting for you to enjoy. I couldn’t have found a better place to celebrate my partner’s birthday. <br/>Tip: turn out every light on the premises and go outside and stare at the stars. Breathtaking!", "rating": 5}, {"review": "This cabin is so peaceful and cozy! It is the perfect for any type of getaway. I highly suggest it!", "rating": 5}, {"review": "Really thoughtfully designed space that makes you feel comfortable and cosy inside yet very close to the trees and plants you are surrounded by outside.  Great base for hiking along the Salmon River and exploring the area.", "rating": 5}, {"review": "Amazing place to get away from it all in the Zigzag area! Comfort all around, inside and out. Our favorite part was the bigger-than-the couch window that gave us a view of the trees and ferns. Susan is a great host, and the little house up the hill is a great spot to enjoy staying inside or exploring all that the area has to offer.", "rating": 5}, {"review": "Lovely private cabin, well decorated and comfortable in every way. Driveway is no joke!", "rating": 5}, {"review": "The perfect cabin in the woods!  Clean, well equipped, quiet, close to so many great hikes!  I would recommend to anyone looking for a reset!", "rating": 5}, {"review": "Great place and location. Serene and peaceful. Had a great time.", "rating": 5}, {"review": "Wish we had stayed here longer!! Beautifully decorated, great location!", "rating": 5}, {"review": "Enchanting stay, perfect location to Mt Hood. This is a cute, quaint cabin that we enjoyed. Perfect for couples or anyone looking to get outdoors, we will definitely be coming back.", "rating": 5}, {"review": "Adorable cabin. Even Better than the pictures. Outdoor space was amazing. Windows look out onto beautiful northwest forest. Basic condiments were provided in the fridge. Washer dryer was an awesome amenity. Cell service is super spotty. No WiFi.  Steep hill to get up to cabin. All of which are very clearly stated by host. There is a TV upstairs with a DVD player and a few DVDs. Highly suggest to bring DVDs with you if you plan to stay more than a night or two. <br/>All in all,  the cabin exceeded expectations and was a beautiful place to stay.", "rating": 5}, {"review": "The little cabin near Mt. Hood was amazing!!! Highly, highly recommend for a short getaway. Perfect access to Mt. Hood trails and Portland.", "rating": 5}, {"review": "A nice private escape while still being close enough to explore lakes and Timberline lodge. Be prepared to carry your things up the driveway, but otherwise very quiet, peaceful, and a nice weekend escape.", "rating": 4}, {"review": "Super cozy and well decorated.", "rating": 5}, {"review": "Great place - the road is definitely steep and I wouldn’t want to drag my bag up there. Otherwise it was lovely, a bit of road noise, but the place is such a nice easy escape and it was incredibly clean. One thing to note - the range is just a cooktop so plan accordingly! Would def recommend for a couple!", "rating": 4}, {"review": "I stayed a whole week and didn't think the solitude here is <br/>worth the inconvenience associated with the driveway, the lack of connectivity, and the ladder to/from the bedroom.  The driveway is not only a pain when loading/unloading if you don't have 4WD; it's steep and gravel covered and I found it difficult just to walk the 100 yards of it not even carrying much.  The place is very isolated visually, completely surrounded by trees and vegetation, which is really nice.  However, it's fewer than two tenths of a mile from the highway as the crow flies, so outside the house, there is often a lot of noise from this very busy road.  (Inside the house it's quiet.)  <br/>While it might be romantic to be \"off the grid,\" it can be difficult to plan activities from the house because you can't reach a map server to find how far away things are and how to get to them.  Although absolutely nothing went wrong for me while there, you can't text the owner from the house because there's no service.  And regardless of how old you are or what kind of shape you're in, getting up in the middle of the night to use the bathroom is uncomfortable due to the steep climb up and down the bedroom ladder.  The <br/>washer/dryer was really nice.  There is nothing the owner can do about the steep climb to the bedroom because the place is small; however, the driveway could be improved and a wifi scan at the house revealed several nearby networks so I think connectivity could be improved too.", "rating": 3}, {"review": "The cabin is simply amazing.  It was very close to hiking trails and had everything needed for a comfortable stay!", "rating": 5}, {"review": "This little cabin is the perfect escape. It’s super easy to get to from PDX, but it feels like your miles away from anything.  Couldn’t ask for a better location for a weekend away!", "rating": 5}, {"review": "My husband and I stayed here for one night of our honeymoon road trip. This hidden gem is absolutely gorgeous. It was so nice being “off the grid”. The decor and scenery were amazing and the kitchen is equipped with all the essentials for an “at home” dining experience. We definitely would love to stay here again if we’re ever in the area.", "rating": 5}, {"review": "Great location! The views to die for, quiet serenity, surrounded by nature, & perfect for romantic weekend with significant other. Highly suggest 4 wheel drive if you don’t want to walk up and down drive way (if you don’t have 4 wheel drive). We didn’t think it was too bad but if you have a lot of luggage and don’t have great balance you may not want to have to walk up the gravel driveway. Close hiking trails which was major perk.", "rating": 5}, {"review": "This incredible gem in the Mt. Hood National Forest is half cabin, half thoughtfully-designed tiny home. It’s perfect for any Portlander needing to get away for a couple of nights. Only 2 minutes off the main highway, but once you arrive it feels like you’re in a little clearing deep in the forest. Susan has thought of everything one could possibly need and her hospitality was lovely. I’ll never forget what it felt like to be here and it’s inspired me to create a place like this someday.", "rating": 5}, {"review": "This place was great! Very quiet and private. We met the neighbor’s little dog after it chased our truck up the driveway lol. The neighbor quickly got his dog and apologized. They were both very friendly so no worries. <br/>The driveway was very steep and even a little challenging in our AWD truck but we managed to get up and down just fine. I suggest getting everything you need (food, wood, water, etc.) before you arrive to minimize your trips up and down the driveway. The dollar store down the road had the best prices. <br/>The only issues we had were getting the door to lock and no phone service. The phone service wasn’t an issue besides not being able to communicate about the door issue or check in. I suggest you plan out your daily activities and find restaurants/hiking trails you want to go to before you get there because it will be more challenging to do without service. <br/>Overall great trip! Fire pit was great! I would definitely recommend. My girlfriend and I loved it.", "rating": 5}, {"review": "Great little cabin in the woods! Felt much more isolated than other cabins we've visited in Rhododendron. Comfy bed and living space with well appointed kitchen. We recommend getting Skyway BBQ at least once. Loved the big boss cat!", "rating": 5}, {"review": "Really a unique stay. The mini cabin is secluded above the owners back part of their property. Sweet big windows,  that make you feel immersed in the ferns and forest. The wood stove, and sitting area inside are perfectly quaint. Everything is there you need inside to be comfortable. Outside I think is the best. The fire pit area and little porch are perfectly nestled amongst the trees and outdoor landscape. Overall a great little stay. Do note: Drive way up to the cabin is steep! Head the warning in good or bad weather. Enjoy!", "rating": 5}, {"review": "We absolutely loved staying at this cabin. Beautiful in and out, clean, and plenty of hot water from the shower. I was especially impressed with the artistic style throughout (cutest artwork ever) and the big, beautiful trees outside. My husband enjoyed fireside smores and wished we had booked longer than just 2 days. Thank you for all your efforts Susan!", "rating": 5}, {"review": "Absolutely adorable cabin in a very private and cozy location. If you like critters like my husband and I do, you’ll be happy to know there are salamanders all around the property at night. The decor was great and the washer/dryer was an absolute perfect addition!", "rating": 5}, {"review": "Susan was a great host and her home was beautiful. If I were blessed with another opportunity to stay at Susan’s cabin, I would 100%", "rating": 5}, {"review": "Beautiful cabin, small ski town close to the location.We spent the weekend kayaking and fishing.", "rating": 5}, {"review": "What a very cute place with a great fire pit. Amazing location! I recommend bringing your own pillows as the ones on the bed are very small.", "rating": 5}, {"review": "great place lots to do in the local area, and lots of privacy", "rating": 5}, {"review": "We loved this tiny house! Private and beautiful and fabulous all around.", "rating": 5}, {"review": "By far the most magical place I’ve ever stayed! It feels so private while being so close to the great restaurants and shops. Every detail is thought out and the house is so well made. I haven’t felt this peaceful in awhile. I can’t wait to return.", "rating": 5}, {"review": "Susan's cabin is a wonderful retreat. It took us away from the hustle and bustle of our home lives to a space that felt carefree. It was cozy, comfortable without the usual life's conveniences, like cable TV and wi-fi, we enjoyed the opportunity to disconnect.", "rating": 5}, {"review": "The cabin was immaculate and located in such a beautiful + serene place. I'd stay here forever if I could!", "rating": 5}, {"review": "GREAT place. A great romantic getaway. Bed is super comfortable! Stores and restaurant nearby. Just the perfect place in the heart of the Forrest.", "rating": 5}, {"review": "Great spot, just what we needed. I was showing some family around that flew in from Boston. This was a great place to stay so they could see MT Hood.", "rating": 5}, {"review": "We loved this space, so cozy in the woods. Option to have a fire inside or outside and loved reading our books outside in the Adirondack chairs. Super clean and comfortable with lots of great hikes nearby and gorgeous sky at night. Be aware that the hot water runs out quickly so if you have two people showering, go fast! Would totally stay here again.", "rating": 5}, {"review": "It was so detailed, they had everything you needed for the stay. Definitely a good place to visit!", "rating": 5}, {"review": "Great lil cabin for a getaway we had a really nice night there and super cozy I’d recommend to anyone", "rating": 5}, {"review": "This was the perfect little getaway to relax and unwind after exploring the area’s natural wonders. If possible, this little cabin is even better than it appears. We chopped wood to fuel the wood-burning stove, took in the lush surroundings, & enjoyed the serenity. Everything we could want and more, would highly recommend!!", "rating": 5}, {"review": "Straight out of a fairytale. Walking up the steep driveway slightly and just a tad out of breathe we both managed to say “ wow” <br/>This little cabin was EXACTLY what we needed after three days of camping.  <br/>It seems as though every nook and cranny was used to its utmost advantage.  It has everything you could need. Decor was spot on and the panoramic views from the inside looking out was serene.<br/>The fireplace outside was our go to, we just sat and and enjoyed the present time truly feeling like we were in some sort of alternate moss and forest infused universe. <br/>Twas a perfect ending to our adventure.<br/>P.s.<br/>Try the bbq place right across the street!", "rating": 5}, {"review": "This cabin was the perfect weekend getaway! We especially loved the location deep in the woods. There is a huge window behind the couch that makes you feel like you are lounging in the wilderness. The cabin feels brand new and has everything you need. The fire pit was a bonus!", "rating": 5}, {"review": "Wish we were able to stay longer, incredible! Thank you.", "rating": 5}, {"review": "Susan's cabin is fantastic! My husband and I absolutely loved spending time there. I'd recommend it to anyone looking for a cozy vacation!", "rating": 5}, {"review": "Such a sweet gem! I enjoyed my stay very much and the cabin is exactly as described!", "rating": 5}, {"review": "A wonderful. peaceful, relaxing stay!", "rating": 5}, {"review": "Enjoyed a wonderful stay in the little cabin in the woods! Amazing location that makes it the perfect spot for relaxation and reflection!", "rating": 5}, {"review": "Cozy little cabin surrounded by a huge forest, really good for a relaxing getaway. Plus somebody’s cat wandered up to say hi to us so that was an extra positive!", "rating": 5}, {"review": "This cabin was awesome!  Very secluded, as well as one of the cleanest places I have stayed.", "rating": 5}, {"review": "Amazing cabin so cozy and beautiful!!!", "rating": 4}, {"review": "Private, comfortable, and very clean. Everything we needed for a relaxing couple of nights. We stayed warm, slept soundly, and ate well (groceries from Thriftway, BBQ from Skyway). We enjoyed hiking the Salmon River Trail. And when the clouds parted for a moment one night, the view of the stars from the front porch was incredible. <br/>Tech notes: The steep driveway is no joke. We would not have managed it without AWD. Our cell signal (Sprint) was zero to weak -- slightly better outside than in.", "rating": 5}, {"review": "Had a great relaxing cozy time. The wood stove and all the cabin decor was so cute. We stayed 4 nights and didn’t want to leave. The view from the cabin was amazing. It was close to Mt.Hood and lots of hiking or snowshoeing around.", "rating": 5}, {"review": "Wonderful place to stay! Even cuter than the pictures.", "rating": 5}, {"review": "Unique stay, with thoughtful touches. Between deer antlers, cool sofa throws and unique wall decor it really felt like a “cabin in the woods”. Highly recommend, had a great time.", "rating": 5}, {"review": "The place was really nice and cozy.  Unfortunately, the power went out during our last night there and was out through the morning & checkout.  We messaged the host a heads up and some questions, and we didn’t hear back.  Had this not happened I would have given the place 5 stars, but it did.", "rating": 4}, {"review": "The location was great it’s very private and quite. We will definitely stay again.", "rating": 5}, {"review": "Love this place - contemporary, cozy, and super clean.", "rating": 5}, {"review": "Great place and very peaceful. If your going in the winter bring a shovel with you and bring snow pants and snow boots as well", "rating": 5}, {"review": "Great place and communication!", "rating": 5}, {"review": "Would recommend staying here. Had a great time, the amenities were very nice and the check in process was easy.", "rating": 5}, {"review": "We loved this place! It has everything you’d need but nothing more than you’d want. Nice and cozy for the perfect little get away. Fire place does great and keeping the loft warm and is nice and relaxing too!", "rating": 5}, {"review": "Great mountain getaway. Very cozy love the big window!", "rating": 5}, {"review": "Cozy cabin in a peaceful setting, nestled in the woods for a getaway from the hustle and bustle of life. The space is well thought out and stylishly appointed. We loved the wood burning stove in the cabin - kept us warm and cozy throughout our stay. Everything was perfect and we are already looking forward to our next getaway to the little house on the mountain!", "rating": 5}, {"review": "This is a sweet, private cabin that is perfect for an unplugged weekend. Close to the slopes, across the road from some great BBQ, and tucked in the trees, this is an ideal location for your stay on Mt. Hood.", "rating": 4}, {"review": "Very cozy cabin with tasteful decoration and upscale amenities. We loved all the extra little touches that made our stay in the pretty Mt. Hood woods excellent!", "rating": 5}, {"review": "This place is very cozy and cute! You can tell a lot of thought went into each detail. Perfect for a getaway whether you just want to recharge or have a fun time at the mountain! We loved it", "rating": 5}, {"review": "Cozy and clean, perfect for some good old fashioned quality time with a loved one.", "rating": 5}, {"review": "The cutest mountain cabin. Clean and cozy!", "rating": 4}, {"review": "Nestled in the forest atop a little hill, this cabin was the perfect holiday getaway. The space is thoughtfully designed with everything you’d need to “power off” — board games, DVDs, candles, coffee and full kitchen amenities. There’s a fire pit too— we couldn’t take advantage due to rain but it had all the makings for a lovely evening under the stars.<br/>Given the state of things in 2020, I especially appreciated how meticulously clean the cabin was when we arrived. I’d definitely recommend a stay here!", "rating": 5}, {"review": "Nestled at the top of the neighborhood hill, sits this pristine transportation device that takes you to another world. The warmth and vibe of this place were exceptional for decompressing and sparking some inspiration. The place was very clean and had all you need to enjoy some peace and tranquility. Really loved the fox paintings! I plan to visit again and hope to own a place like this someday!", "rating": 5}, {"review": "My husband and I usually have an annual family vacation, this year it was cancelled due to covid. We ended up planning to go up the mountain and in the midst of planning that I found myself looking at this cabin, we booked it and it was the best little getaway ever! Totally worth it.", "rating": 5}, {"review": "This little cabin is awesome. The location is great and provides easy access to Mt. Hood. It is warm and cozy, and the wood burning oven in the living room is a huge plus. You definitely need an AWD/4WD car to get up the driveway, but that’s not a big deal at all. Overall great stay, and we will definitely be back!", "rating": 5}, {"review": "We had a lovely stay at Susan's sweet cabin. Very private, cozy and quiet.  Nice artistic touches. Beautiful forested and mountain views from the big windows.", "rating": 5}, {"review": "A rare gem nestled in a woodsy neighborhood near Mt Hood. A charming and cozy tiny home that was stunning inside and out. One of the few places that looks even better than in the photos. While  our stay was part of our eighth mother-daughter trip, this is perfect for bringing significant others. And, it’s so close to all the Mt Hood area offers!", "rating": 5}, {"review": "This cabin is a perfect getaway for two!  Clean and tidy with thoughtful design and amenities. We will definitely be back!", "rating": 5}, {"review": "Cozy and nicely decorated place to stay in convenient location for great hikes...also, very responsive host!", "rating": 5}, {"review": "This place is amazing! Such a sweet nicely decorated and cozy little cabin nestled in the woods. Very private feeling. The forest behind the cabin is wonderful for exploring. This is a sweet spot for a romantic getaway 💚", "rating": 5}, {"review": "What a gem! This cabin was so cute and cozy. It was a perfect little getaway. There were so many personal touches that you don’t usually come across in an AirBnB. I’d recommend this cabin to anyone looking for a getaway near Mt. Hood.", "rating": 5}, {"review": "We had a lovely stay. The space was perfect and felt special. Susan was helpful and attentive.", "rating": 5}, {"review": "Perfect little peaceful space nestled in the woods just big enough for me, mySelf and I 😊", "rating": 5}, {"review": "We absolutely LOVED it here! It was so cozy, and the perfect little getaway. I would highly recommend it to anyone looking to stay - just make sure you have an AWD 4-wheel drive car because it is a steep driveway! Susan was quick to respond, and made sure we had everything we needed. Great hospitality!", "rating": 5}, {"review": "My best friend and I loved Susan's cozy cabin in the woods. It really is the sweetest place that now has me seriously dreaming about someday owning something like it. The setting is just perfect - tucked into the trees but still spacious outside of the house, and the interior has everything necessary for a cozy stay.", "rating": 5}, {"review": "Beautiful Place to stay away of everything 🙏🏽", "rating": 5}, {"review": "Beautiful place for hiking. We love the forest and this little house! Thanks!", "rating": 5}, {"review": "Exactly as shown - location perfect! The cabin couldn’t be cuter🍁", "rating": 5}, {"review": "Great space for a couple. We loved our trip! Check in was smooth and the space was clean and beautiful.", "rating": 5}, {"review": "Susan's place was nice and quite. Very homey and nice touches here and there. Enjoyed the stay.", "rating": 5}, {"review": "This is place was amazing. Would highly recommend staying if you are visiting mount hood.", "rating": 5}, {"review": "Beautiful cabin retreat, the perfect way to go to the mountain and escape. If it's free, don't hesitate!", "rating": 5}, {"review": "Cute cabin, well decorated, perfectly cozy. Will definitely stay here again!", "rating": 5}, {"review": "The cabin on Zig Zag was so peaceful and carefully designed. We spent lots of time hanging out around the fire pit, making morning coffee to watch the sunrise on the covered porch, and watching movies while it rained. The cabin was easily heated and cooled. The surrounding area is beyond beautiful. If we make another trip to Oregon we will be back! Thank you Susan! 🙂", "rating": 5}, {"review": "Such a cozy cabin in the woods! Even though it rained for the 3 days we were there, it was so peaceful. A major disconnect from the world!", "rating": 5}, {"review": "What a great cabin by Mt. Hood. Host was quick to respond and the place was amazing. Relaxing private cabin with all the modern features. If I’m in the area again I will look to book here. Thank you Susan!", "rating": 5}, {"review": "Super stylish & fancy cabin in the woods, near the most exquisite hiking trail (Salmon River) that I've ever been to. Lovely big windows that endlessly showcase all the beauty that Oregon has to offer. Not really recommended for people who aren't very fit as the road to it can be a bit steep. This place is like taking a small slice of city living with you deep into the woods, while keeping up maximum chic.", "rating": 5}, {"review": "Excellent little place with a lot of nearby activities", "rating": 5}, {"review": "What a sweet little retreat. The huge window looking out to beautiful green trees and the thoughtful touches, including lights on dimmers and eco-friendly cookware make this such a wonderful spot for a quick getaway. I especially appreciated how clean and tastefully decorated the cabin was. I look forward to returning!", "rating": 5}, {"review": "I have been to many Airbnb’s and this is one of the best that I have been to! It is a very stylish, clean, and functional space. Everything within the cabin was high quality and looked very new - the windows, the kitchen appliances, the floors, etc. Everything all the way down to the fixtures in the bathroom and the knife set in the kitchen! The hosts have done a phenomenal job with this place and I can tell they have thought through the guest experience. <br/>The location was great. It has easy access to Mt. Hood and Government Camp. The scenery was lovely as well. Beautiful trees surround the property and the views from the windows and from the front deck/porch is picturesque. <br/>One thing to consider is the ladder up to the loft bedroom. If you are elderly, you might have a hard time getting up and down the ladder as the incline is a little steep. My wife and I are young (mid-20’s) so it didn’t bother us in the slightest, but it may be something to consider if you are concerned about your mobility. <br/>I think this is a “don’t miss out” type of place. I would stay here again in a heartbeat!", "rating": 5}, {"review": "Great spot!", "rating": 5}, {"review": "This cabin was perfect! Cute and cozy. I already have friends asking for the location so they can book it!", "rating": 5}, {"review": "Awesome place!", "rating": 5}, {"review": "We thoroughly enjoyed our stay at Susan’s. The cabin is super cute and close to breathtaking hiking. Would recommend!", "rating": 5}, {"review": "Beautiful place. We enjoyed our quick getaway. The place was easy to find and was in a great location convenient to other areas we wanted to explore. You can’t use the campfire due to a fire ban but having the grill was good enough. Will recommend this place!", "rating": 5}, {"review": "This tiny house in the woods was exactly what we needed.  It's a beautiful space and close to everything the mountain has to offer, but it feels like you're in your own world while you're there.", "rating": 5}, {"review": "cute and cozy place in a beautiful location. susan was very welcoming and gave us useful recs on things to do in the area. <br/>on our second day, we woke up to the oregon forest, went hiking along the gorgeous salmon river, and grilled while enjoying the sunset—it was one of my best days in recent memory.<br/>don’t miss this place. download your movies + songs ahead of time!", "rating": 5}, {"review": "This is a really unique space and you can tell they put a lot of thought into it when putting it together! We really enjoyed not having WiFi and being able to disconnect.", "rating": 5}, {"review": "Susan's cabin is beautiful! The couple days we stayed were a much-needed break from the city. The grill was ready to go when we arrived, and the amenities we needed (towels, extra blankets, cleaning supplies, etc.) were all there. We drove to the Mirror Lake Trailhead, about 15 minutes away and enjoyed that outing too!", "rating": 5}, {"review": "The Tiny cabin was amazing! Blew away my partner and I’s expectations. Very clean and the decor was very cute, stylish and cozy. Outstanding!", "rating": 5}, {"review": "Like a playhouse for adults, this space is adorable! Great outdoor space too. Check out Skyline Bar and Grill across the street. They have figured out how to create a joyful dining experience amid covid. Highly recommend both places.", "rating": 5}, {"review": "Location is conveniently close the to highway. Home is very open and makes it feel like part of its natural surroundings.", "rating": 5}, {"review": "Phenomenal little cabin. So tasteful, cozy, and well-located. It is close to everything you would want to see in the area. It is clean and has everything you need.", "rating": 5}, {"review": "This cabin is gorgeous. My fiancé and I stayed here for our engagement trip and it was the perfect spot to get away from people. The driveway is a little steep but our rental SUV made it up just fine . We will definitely be back in the future!", "rating": 5}, {"review": "I want to go back ASAP!!!", "rating": 5}, {"review": "I really liked my stay at the cabin. It was clean and cozy. I great get away to relax, read and unplug from the world. I will be back in the future.", "rating": 5}, {"review": "The cabin was super cute and very comfortable, It was the perfect spot for a weekend getaway.", "rating": 5}, {"review": "Such a lovely cabin! Charming and cozy, and with so many personal creative touches. Everything you need for a simple few days stay is there. The indoor space is comfortable and well organized. The setting is perfect, set back off the road with the woods behind, so you feel tucked away but not too remote. The fire ring in the front outdoor space truly completed the experience. We needed a peaceful escape from the city and we truly found it! <br/>Thank you, Susan!", "rating": 5}, {"review": "I had such a lovely time here!  With everything going on in the world I really needed a place to disconnect with the outside world and reconnect with the outdoors world.  This was perfect - clean, cozy, and a lovely design.", "rating": 5}, {"review": "A perfect getaway on the mountain for 2!", "rating": 5}, {"review": "This spot is even cuter than the pictures make it out to be. My boyfriend and I had a lovely long weekend romping around in the woods, sitting by the fire, and cooking on the stovetop (getting creative at times!). Would definitely love to visit again (~:", "rating": 5}, {"review": "What an amazing stay! Very cozy, well decorated, chic and campy, had everything we needed, it was perfect.", "rating": 5}, {"review": "Just wonderful!", "rating": 5}, {"review": "This was even better than expected! Being both inside and outside was remarkable, and I felt completely at peace. <br/>It wasn’t noted but there is a wonderful AC fan unit, fun board games, and a DVD player with a small assortment of DVDs for lounging in the loft bed. (Which is super comfortable) <br/>Also just miles away is a store area with everything you need if you forgot anything. <br/>Close by is some remarkable hikes as well. PERFECT SPOT! Will be coming back!", "rating": 5}, {"review": "Susan‘s cabin is really great. It is cozy, warm, beautifully arranged, and it was sparkling clean when we got there! It is really well positioned in the area, and close to the main landmarks and trail heads, so it was absolutely perfect for our trip. Would highly recommend staying here, if you’re looking for a secluded area to relax..", "rating": 5}, {"review": "I rented this cabin for one night to escape Portland. It is an excellent place to just rest and enjoy nature. You feel isolated on top of the hill but I was comforted by the fact that there were nearby houses. I would highly recommend staying here.", "rating": 5}, {"review": "A good description of our experience in the little cabin would probably be something along the lines of 'bathing in the forest'. The large window that we were greeted with upon entering the home made it feel like the forest was an ocean and that we were enveloped in its waters. It was a truly unique experience. The space was also very beautifully decorated - each piece felt very intentionally placed. The small details were my favorite.", "rating": 5}, {"review": "So happy we found this cute gem in the mountains! Very clean, cozy and stylish!", "rating": 5}, {"review": "Exactly as advertised and spotlessly clean. I loved the opportunity to chop firewood for the woodburning stove. The huge view onto a wall of plant life in the forest was beautiful. A peaceful getaway.", "rating": 5}, {"review": "Beautiful location that truly is a getaway. The cabin is beautiful, inside and out. You’re surrounded by trees and have a lot of privacy, but close enough to amenities that it’s not a headache if you need to get any items from the store. You have to walk up a steep hill to get to the cabin, and the stairs to the bedroom are more like a ladder, so people who are out of shape or lack mobility would have a hard time staying here. <br/>Take note that there’s no WiFi and cellular reception is spotty, so you’ll want to be prepared for some real disconnect time. There’s a DVD kiosk at the local grocery store though if you want to rent a DVD to watch up in the bedroom loft. <br/>Self check-in was easy and convenient. Thank you for such a lovely space!", "rating": 5}, {"review": "LOVE!!  My husband, son and I love everything about this tiny home on zig zag mountain.  It's thoughtful design makes the space feel larger and the HUGE picture window overlooking the abundant, green clover field on the cliff was stunning.  Comfy furniture & beds, well equipped kitchen and awesome fire pit area were great added touches!<br/>We will be back!!", "rating": 5}, {"review": "Very stylish and cozy place to stay!", "rating": 5}, {"review": "Hands down cutest Airbnb we’ve stayed in! So quiet and quaint, right off the highway and you wouldn’t even know it with how quiet it is. Definitely make sure you have a 4WD vehicle to get up the driveway. We’ll definitely be back!", "rating": 5}, {"review": "What a perfect little cabin off the beaten path! Perfect get away for the weekend!", "rating": 5}, {"review": "Great location and place!", "rating": 5}, {"review": "This tiny home is beautiful. The location is private and stunning and the fireplace adds a great place to relax all night. Even though it’s a tiny house, you don’t miss out on any amenities. The driveway is steep which may be difficult in poor weather. Other than that, this is one of the nicest places I’ve stayed!", "rating": 5}, {"review": "Great little cabin in the woods. The place was really clean, quiet, and had everything we needed for a weekend getaway. Susan was very responsive to messages and gave us some great recommendations on places to see. We would definitely come back here for another weekend getaway in the future.", "rating": 5}, {"review": "Susan clearly put a lot of thought and work into creating a welcoming, adventurous & calming place. I had no problem getting my Subaru up the driveway. I would describe the experience- from the decor to the fire pit & comfy bed as a breath of fresh air!", "rating": 4}, {"review": "I had an amazing time at the cabin, enjoyed every second pictures are 100% accurate no complaints, except for the fact that the fact that a 4WD car is needs to be able to drive all the way up hill to the location of the cabin.<br/>So we had to park down hill and bring all our groceries and bags up with a plastic sled and is pretty steep, something that should be explained even before booking.<br/>Kitchen is small if need to cook something elaborate.<br/>Other than that great place, had a great time.", "rating": 4}, {"review": "Our stay at Susan’s cabin was delightful. The space was cozy, clean, and so cute. We would hope to return!", "rating": 5}, {"review": "This cabin was the perfect space for two people to get away from the city and to have some peace and quiet. Getting to the cabin was a bit of a hill, but once you arrive to the top you drive up to the beautiful view of the cabin in the fire pit. Once inside you are speechless with the perfect decor And comfortable space. Susan was helpful during the trip. %100 would rent this again!", "rating": 5}, {"review": "This house is absolutely amazing! Susan definitely has something special here. The house was spotless and very welcoming. Would definitely recommend a stay here!", "rating": 5}, {"review": "This place is beyond adorable. The pictures don’t do it justice. It’s on top of a hill that has a great view of the National Forest. The host left us firewood to have an outdoor fire, which is exactly what we wanted when we got there. <br/>We were curious on staying in a tiny house as we have never stayed in one before, but it was perfect. It had everything we needed for the weekend.", "rating": 5}, {"review": "Amazing location and a great secluded feel. The tiny house is very modern but just rustic enough to feel like you really are in a cabin that’s been there for ages. My girlfriend made the comment that it’s like a fairyland environment 😂 Susan is very quick to respond and extremely friendly.", "rating": 5}, {"review": "Spent my 3 year anniversary with my boyfriend at this cabin. It was very cozy and cute. I loved my experience and I'll definitely be back!", "rating": 5}, {"review": "Incredible Airbnb! The perfect place for a quick getaway.  The cabin is beautiful and set in a gorgeous scenic area. Susan is an amazing host!", "rating": 5}, {"review": "A beautiful tiny cabin in a private setting.", "rating": 5}, {"review": "Susan was a wonderful host, the place was spotless and so cozy! We had such a nice relaxing stay and we’ve already recommended the place to our other friends and family! If you’re looking for a secluded escape from the city this is the place to go. There’s walking trails less then a mile away as well.", "rating": 5}, {"review": "This cabin is the perfect little get-away, nestled perfectly in the woods and tucked away from the rest of the world. We were able to enjoy an outdoor fire in the fire pit as well as a fire in the wood stove when it got too cold to be outside, a home-cooked dinner, and the perfect cozy atmosphere to relax. Thank you for a wonderful weekend!", "rating": 5}, {"review": "Very nice space, perfect for an individual or couple.  Susan was very quick to respond to messages and helpful in connecting with local trails and places to visit.", "rating": 5}, {"review": "Great place to stay!", "rating": 5}, {"review": "Great spot up the hill from the main house.  Beautiful, well designed small cabin - great place to escape & relax.  Woods & creek that meander up the hill behind the cabin - good spot to wander around (no real trails if that's what you're looking for though).  Perfect escape, no complaints.", "rating": 5}, {"review": "This little cabin was beautifully decorated with thoughtful touches. We were very cozy under blankets by the fire watching the snow fall through huge windows. Susan was very helpful as we figured out the wood stove! The kitchen had almost everything we needed to cook for a few days, and we got extra supplies easily from a nearby store. Would love to return!", "rating": 5}, {"review": "It was an amazing little getaway for the weekend. Couldn’t have been happier with it!", "rating": 5}, {"review": "Such a cute space! It was very clean and it was so well decorated. Plenty of kitchen supplies. Had a dishwasher and washer and dryer which would be great if staying for more than a couple days! We will be back!", "rating": 5}, {"review": "Loved staying here. Quiet and relaxing.", "rating": 5}, {"review": "A luxury cozy getaway to the mountain!", "rating": 5}, {"review": "Lovely cabin in the woods to step away and truly enjoy the Mount Hood area.", "rating": 5}, {"review": "This is an amazing cabin. Perfect for two people. The surroundings are Gorgeous, I hope I get a chance to stay here again", "rating": 5}, {"review": "This was such a great experience! Susan was an awesome host and the cabin is amazing! Would definitely recommend this to anyone looking to get away for a weekend. My wife and I enjoyed snowboarding during the day and a relaxing night in this cozy cabin!", "rating": 5}, {"review": "If a cozy/romantic getaway is what you’re looking for, then absolutely look no further. Susan’s tiny cabin is everything you could ever ask for when looking for an escape from the hustle and bustle of every day life. The cabin couldn’t be cleaner and is seemingly secluded from everything and anyone. The kitchen, though small, is perfect for cooking at home, and if you want to go out, there are plenty of options right down the road! (Wraptastic was a personal fav) We can’t say enough good things about the space Susan has created and would be so lucky to make a return trip.", "rating": 5}, {"review": "It was really a wonderful spot. Highly recommend.", "rating": 5}, {"review": "This is a must-stay in the Mt. Hood area. It is the perfect place to spend your time hiking or skiing!", "rating": 5}, {"review": "This is an incredible spot for a romantic weekend getaway. The location is beautiful and not too far from Portland, and the cabin itself is absolutely gorgeous and cozy. Would definitely stay here again and highly recommend!", "rating": 5}, {"review": "This home was a GEM! Susan was incredibly thoughtful in all the details of the house. It was also very clean! Would love to stay here again! If you are thinking about booking... do it!", "rating": 5}, {"review": "The coziest cabin in the woods! This space is so clean and Susan has curated it so wonderfully! It’s the perfect spot for two and also so close to the ski areas! Highly recommend!", "rating": 5}, {"review": "Such a perfect spot to get away, close enough to the mountain & town to have everything you need. One of the coziest places I’ve stayed!", "rating": 5}, {"review": "Would recommend this place to anyone looking for a private, charming, and cozy getaway. My boyfriend and I had such a nice time and we will hopefully come back sometime soon!", "rating": 5}, {"review": "Terrific modern , yet very cozy cabin!<br/>The best Airbnb experience I’ve ever had", "rating": 5}, {"review": "One of the cleanest places I have ever rented. The entire area inside and out was beautifully maintained and decorated. This is such a perfect little cabin to stay in and you're guaranteed to have a wonderful stay. Susan is an amazing host and creates a super smooth check in and out process for your stay. I highly recommend staying here!!", "rating": 5}, {"review": "Great place to stay! I stayed here with my husband while we skied at Timberline for a few days. Great proximity to the slopes and nice get away. 10 out of 10 would recommend!", "rating": 5}, {"review": "Perfect cabin in the woods for a weekend getaway.", "rating": 5}, {"review": "This is the perfect couples retreat. You’re off the grid enough but still have options close by. We had a wonderful stay, couldn’t have asked for a better spot. Truly, it’s small but it’s mighty, had everything we needed and more. We got engaged during our stay so now it’s extra special to us.", "rating": 5}, {"review": "Cozy and comfortable cabin, close to tons to do in the Mount Hood area! Was in perfect condition for our arrival, highly recommend staying here!", "rating": 5}, {"review": "Get cozy and snuggle by the fire... this little place is a gem!", "rating": 5}, {"review": "This cabin was perfectly situated in a quiet and wooded area. The cabin was very rustic and met our needs for our short trip. We enjoyed making fire both outside and inside with the wood stove. And Susan was a kind host and very responsive. We enjoyed a nice, relaxing stay.", "rating": 5}, {"review": "This is a cozy little cabin that is well situated for privacy.  The kitchen is sparse but we were able to make it work for us, just plan on keeping it simple.  If you plan on using the wood burning stove you might want to bring some old newspapers to help get it started.", "rating": 5}, {"review": "Would highly recommend a stay at this adorable little house on the mountain! 100% perfect.", "rating": 5}, {"review": "This tiny cabin is perfect! It was a little closer to other houses than I expected, but still felt pretty secluded. We loved our stay here and look forward to coming back!", "rating": 5}, {"review": "Beautiful isolated location!! We enjoyed every minute spent in this beautiful home and wished we could of stayed longer! It’s so cozy, clean, and quiet!", "rating": 5}, {"review": "This is a truly magical little house. It is set back and feels very private. The style and feel is truly magical. A perfect little hideaway tucked in the woods.", "rating": 5}, {"review": "2 words - absolutely immaculate. Susan thought of almost everything for this cabin and built it with exceptional craftsmanship. She stocked the kitchen with every little thing you might need and clearly cared a lot about building a functional, cozy, and quiet cabin. Loved the stay.", "rating": 5}, {"review": "By far the cutest cabin I have stayed in. The location was perfect and the view is amazing. We can’t wait to make a trip back!", "rating": 5}, {"review": "Susan's cabin was extremely welcoming and warm. The drive up to the cabin was amazing and fun. It was fun to stay a couple nights in the woods. The place felt open and comfortable. We had a great time together in our first night in Oregon. Great memories were made in this place! We spent a lot of time looking out the open windows!", "rating": 5}, {"review": "This place was fantastic! Highly recommend!", "rating": 5}, {"review": "The cabin is so cost. We had a great time explore the area. We made fire outside and made smores it was so much fun. The location is great too. Close to local shops as well as the trails. Susan replies out texts super quick. Thank you so much!", "rating": 5}, {"review": "A beautiful little cabin near great natural sites. I was worried we’d get cold at night but the heaters available really kept us cozy. Someone left an annual pass at the cabin so we didnt need to buy one but we still left a donation at the ranger station to help support. I just cant thank Susan enough for creating such a beautiful setting for our stay.", "rating": 5}, {"review": "Extremely clean and cozy cabin in a great location. Would highly recommend!", "rating": 5}, {"review": "Best place ever!!!!", "rating": 5}, {"review": "Susan's tiny house is delightful and charming! I had a very relaxing, comfortable stay. It was just as stylish as pictured and had everything you would need to unwind and enjoy the surrounding forest. It is close to the highway, and while there were distant neighbors,  it was remote feeling and peaceful. I would happily stay again!", "rating": 5}, {"review": "Adorable cabin. Highly recommend it. Only issue we had was firewood being wet so I just recommend getting dry logs on your way in. But great place to disconnect.", "rating": 4}, {"review": "This was such an amazing get away. Down to the smallest details, we couldn’t stop talking about how amazing this little house in the woods was. We cannot wait to come back!", "rating": 5}, {"review": "Beautiful cabin! Generous and helpful hosts!", "rating": 5}, {"review": "Susan's cabin was perfect. Exactly as advertised.", "rating": 5}, {"review": "This is a beautiful little home, clean, comfortable, & stylishly decorated. Susan is quick to reply & accommodate you in anyway she can. The house is quiet & secluded, yet w/I easy driving distance to many trailheads. We really enjoyed our stay.", "rating": 5}, {"review": "Such a comforting, clean and welcoming little cabin nestled in the woods. Communicating with Susan was seamless, she was very helpful. The cabin is in a perfect location - near trails and lakes. A wonderful Pacific Northwest getaway spot!", "rating": 5}, {"review": "Get ready to be amazed at how cute and nice this Cabin is. For a tiny house, it has all the amenities you need. Being tucked up in the mountains and surrounded by Grand Firs and huge Cedar trees makes you feel secluded even though your close to town. It’s perfect! The only recommendation would be WiFi so you can research activities in the area:) but other than that, we were very pleased with our experience!", "rating": 5}, {"review": "This place was love at first sight when I saw it on Airbnb! The pictures are amazing but to see it in person is another thing! Beautiful decor throughout and great amenities. The sofa was very comfy with the pillows and throw. The huge picture window behind the sofa was super cool! Felt like we were in the forest for sure! The bed was amazing to sleep in with the nice heavy bedding and faux fur throw. The shampoo/conditioner and body wash smelled so good, I want to go to the store and buy the same ones! Lol!<br/>My mom and I had a relaxing time here. Even if it was one night, it was an amazing getaway. Wish we could’ve stayed longer.<br/>Next time, I plan to bring the hubby for sure! This place has inspired us to create a little cabin for my parents on our property in Alaska! It’s that well done! Outstanding job, Susan! Hope to be back again someday! Thank you so much!", "rating": 5}, {"review": "This was our first time in a tiny house and we were a little worried being on the taller side ourselves! My 6’4” husband fit just fine. We really enjoyed the quiet and peaceful setting to get away from our busy household of 3 teens. It was perfect to sit on the cozy couch, front porch or by the fire pit and put up our feet. We will definitely be back and would recommend it to any of our friends.", "rating": 5}, {"review": "We absolutely loved our stay in the ZigZag cabin! The decor and landscaping was absolutely perfect down to every detail. I couldn't imagine a cozier atmosphere to come home to after a day hiking around Mount Hood. Susan was very kind and communicative in ensuring we had all the info we needed to enjoy our time. Thanks so much! We'll definitely be back.", "rating": 5}, {"review": "We had a lovely stay and the space was beautiful. We really appreciated the time she took to help us with our car too.", "rating": 5}, {"review": "Beautiful spot! Really cute tiny house that made great use of the space and had everything. Nice little camp fire area.", "rating": 5}, {"review": "Adorable cabin close to town, but far enough away to feel like you’re in the middle of nowhere. Shuttle to Timberline is close by for awesome downhill mtn biking! Couldn’t have asked for a better place to stay!", "rating": 5}, {"review": "This dreamy escape was so perfect for getting out of the city for a day. Beautiful space, darling decor, & an amazing host. Everything about this spot was excellent. So glad I stumbled upon it. Will definitely be back! Thanks a million for everything!", "rating": 5}, {"review": "This cabin is so wonderful and so beautifully decorated. It’s comfortable and has everything you need and more. The location is beautiful and quiet. The outdoor space is spectacular and there’s a dry creek beside the property. Loved everything about it. We will definitely be back!", "rating": 5}, {"review": "This was such a beautiful space it was hard to leave! Susan was great to be in touch with and my friend and I enjoyed cooking dinner and sitting out late watching the stars. It was super cozy and we really enjoyed our way too short stay.", "rating": 5}, {"review": "Amazing retreat in the woods!  We had the most relaxing time- the cabin is so clean and well decorated (pictures don't even do it justice)!  We will be back!", "rating": 5}, {"review": "Perfect location and unique place. Every detail was thought of in this beautifully decorated cabin. The bed was very comfortable and the cabin has everything that you need. The fire pit and landscaping are done just as creatively as the rest of the place and offer another relaxing space to spend time. Susan was quick to answer any questions and offered local tips. The whole experience was wonderful and we would recommend this gem to anyone wanting something better than the average stay.", "rating": 5}, {"review": "Cute comfy place tucked away in the woods.", "rating": 5}, {"review": "This is a hidden gem amongst a beautiful forest. If your wanting a quiet getaway this cabin is perfect! The location is close to everything for outdoor adventure. <br/>The house was spotless, and absolutely adorable inside. We really didn’t want to leave!", "rating": 5}, {"review": "Loved this place. Susan was quick on responses and very helpful. Cabin was decorated really well.  Awesome experience overall", "rating": 5}, {"review": "Susan’s place is unique and very special. We loved staying there surrounded by forest and woods. It was spotless and beautifully decorated. We’ll be back.", "rating": 5}, {"review": "What a gorgeous place! The perfect getaway! The place was not only super stylish (every detail is really thought out!) but also very clean! We spent a lot of time just admiring all the surroundings and taking advantage of the fire pit (don’t forget to grab some marshmallows down the road).", "rating": 5}, {"review": "Susan was quick to respond to any question I had.  The cabin was a beautiful, cozy place to stay surrounded by trees.  It was exactly what I was hoping for!", "rating": 5}, {"review": "Beautiful cabin with modern amenities and a stunning location. We loved everything about our stay here from the cabin itself, the views, the beautiful outdoor space and fire pit and covered porch, and the location close to Mount Hood. The location was great - convenient access to grocery stores and the Mt. Hood Express Bus for mountain biking, yet it felt incredibly secluded and far from removed from everything. One of the highlights of our trip through Oregon and we would definitely stay again.", "rating": 5}, {"review": "This is an amazing place. Beautiful spot hidden among beautiful moss covered trees. Very stylish and spotlessly clean.", "rating": 5}, {"review": "A very conveniently located and super stylish getaway. We wanted to be near Mt Hood yet also have a little area of our own vs camping. Something that would be cozy indoors and out. It’s the perfect spot for two. You have so many amenities, but you will have to bring or buy some basics. Other than that, you have your own fire inside or out. Decor was very well done, and when sitting on the couch next to the big picture window you can’t help to imagine you’re in the trees...because you’re surrounded by them and all that lush greenery! You will love this little escape and can easily drive up to Timberline or any of the surrounding lakes to get a good hike in!", "rating": 5}, {"review": "A wonderful cottage away from the road. The hosts have thought of everything to make your stay as stress-free as possible. If you are planning a stay in the Mt Hood area we highly recommend this property", "rating": 5}, {"review": "What a gorgeous little home tucked away in the woods. It was peaceful, comfortable and incredibly unique. Make sure you bring whatever is needed, such as coffee or snacks. Dishes and bare necessities are provided. Eye candy is over flowing😍!", "rating": 5}, {"review": "Wonderful little place in the woods.  The house was super cozy and very clean.  The location is phenomenal.  I would definitely stay here again.", "rating": 5}, {"review": "Super cool place!<br/>Highly recommend", "rating": 5}]}